[{"_id":"6447305f145208271b771675","recipe":"Spaghetti and Meatballs","serving":"6","time":"70","calorie":"767","protein":"44","carb":"64","fat":"36","image":"https://www.simplyrecipes.com/thmb/AdhNwERGwUBq5ONIGRk40m9DCZw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Spaghetti-And-Meatballs-SEO-919eb9795fe64f0490415065d82309f1.jpg","website":"https://www.simplyrecipes.com/recipes/spaghetti_and_meatballs/","ingredient":"For the meatballs@@1 pound ground beef (at least 16% fat)@1/2 pound fresh bulk Italian-style pork sausage@2 tablespoons finely chopped basil@2 tablespoons finely chopped Italian parsley@1/2 cup finely chopped cremini brown mushrooms@2 large eggs@3/4 cup unseasoned breadcrumbs@1/4 cup grated Parmesan-Romano cheese blend@2 teaspoons sea salt@2 teaspoons fresh ground black pepper@1 tablespoon extra virgin olive oil@1 splash red wine@@For the pasta@@1 1/2 pounds dry 100% semolina spaghetti, thin spaghetti, or bucatini@Salt, for the pasta water","step":"Prepare the sauce:\r\nHeat the olive oil in a 4 to 5-quart pot on medium-high heat. Add the onions and cook for 2 minutes. Add the garlic and cook for 30 seconds longer or until fragrant.\r\n\r\nAdd the carrots and mushrooms, and cook for 2 minutes. Add the tomato paste, stir to blend, and cook for a minute longer.\r\n\r\nAdd the canned tomatoes, parsley, and basil. Mash and stir the tomatoes with a potato masher until the sauce starts to thicken, about 5 minutes over medium-high heat.\r\n\r\nReduce the heat to low and simmer gently while preparing meatballs, stirring occasionally.@Form the meatballs:\r\nIn a large bowl, use your hands to mix the beef, Italian sausage, basil, parsley, mushrooms, eggs, breadcrumbs, cheese, salt, and pepper. Do not over-mix or the meatballs will be tough.\r\n\r\nUse a small melon baller, cookie scoop, or heaping teaspoon to form 1-inch round meatballs. Roll and compress into tight balls, but don't overwork the mixture.@Brown the meatballs:\r\nIn a separate wide, shallow pan, heat the olive oil on medium-high heat. Brown the meatballs on all sides, about 2 to 3 minutes.\r\n\r\nDepending on pan size you may need to brown 2 batches of the meatballs. Cook them in a single layer; do not crowd the pan by stacking them.\r\n\r\nDo not overcook the meatballs; they will continue to cook in the sauce. You just want to brown them on all sides. Towards the end of browning the meatballs, add a little bit of red wine to deglaze the pan.@Finish and simmer the sauce:\r\nAdd the red wine to the sauce and stir in the cheese. Add salt to taste. Add the browned meatballs and gently stir. Simmer the sauce and meatballs for 30 to 45 minutes, stirring occasionally.@Cook the spaghetti:\r\nWhile the sauce is simmering, bring a large pot with 4 quarts of salted water to a boil (1 tablespoon of salt for every 2 quarts of water). When the water returns to a boil add the pasta to the pot.\r\n\r\nLeave the pot uncovered while you cook the pasta on high heat with a vigorous boil. Put a timer on for 8 to 10 minutes, or according to package directions for al dente pasta (cooked but still a little firm). Drain.@Serve:\r\nTo serve, place a thin layer of sauce on each plate, add the pasta, add sauce and meatballs, and then sprinkle with grated Parmesan-Romano cheese.","rank":"1","__v":0},{"_id":"644730c801769ebc720011c3","recipe":"Banana Bread","serving":"9","time":"70","calorie":"220","protein":"3","carb":"37","fat":"7","image":"https://www.simplyrecipes.com/thmb/qQZKziOB59OIetXjapaxBvrFzZE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Easy-Banana-Bread-LEAD-2-2-63dd39af009945d58f5bf4c2ae8d6070.jpg","website":"https://www.simplyrecipes.com/recipes/banana_bread/","ingredient":"2 to 3 medium (7\" to 7-7/8\" long) very ripe bananas, peeled (about 1 1/4 to 1 1/2 cups mashed)@1/3 cup (76g) butter, unsalted or salted, melted@1/2 teaspoon baking soda (not baking powder)@1 pinch salt@3/4 cup (150g) sugar (1/2 cup if you would like it less sweet, 1 cup if more sweet)@1 large egg, beaten@1 teaspoon vanilla extract@1 1/2 cups (205g) all-purpose flour","step":"Preheat the oven and prepare the pan:\nPreheat the oven to 350°F (175°C), and butter an 8 x 4-inch loaf pan.@Mash the bananas and add the butter:\nIn a mixing bowl, mash the ripe bananas with a fork until completely smooth. Stir the melted butter into the mashed bananas.@Mix in the remaining ingredients:\nMix in the baking soda and salt. Stir in the sugar, beaten egg, and vanilla extract. Mix in the flour.@Bake the bread:\nPour the batter into your prepared loaf pan.\nBake for 55 to 65 minutes at 350°F (175°C), or until a toothpick or wooden skewer inserted into the center comes out clean. A few dry crumbs are okay; streaks of wet batter are not. If the outside of the loaf is browned but the center is still wet, loosely tent the loaf with foil and continue baking until the loaf is fully baked.@Cool and serve:\nRemove from oven and let cool in the pan for a few minutes. Then remove the banana bread from the pan and let cool completely before serving. Slice and serve. (A bread knife helps to make slices that aren't crumbly.)\n\nWrapped well, the banana bread will keep at room temperature for 4 days. For longer storage, refrigerate the loaf up to 5 days, or freeze it.","rank":"","__v":0},{"_id":"6447314401769ebc720011c7","recipe":"Classic Chicken Pot Pie","serving":"6","time":"65","calorie":"560","protein":"25","carb":"44","fat":"31","image":"https://images-gmi-pmc.edge-generalmills.com/1dc0506e-8ac3-49eb-b05c-04f413a0f101.jpg","website":"https://www.pillsbury.com/recipes/classic-chicken-pot-pie/1401d418-ac0b-4b50-ad09-c6f1243fb992","ingredient":"1 box (14.1 oz) refrigerated Pillsbury™ Pie Crusts (2 Count), softened as directed on box@1/3\r\ncup butter or margarine@1/3\r\ncup chopped onion@1/3\r\ncup all-purpose flour@1/2\r\nteaspoon salt@1/4\r\nteaspoon pepper@1 3/4\r\ncups Progresso™ chicken broth (from 32-oz carton)@1/2\r\ncup milk@2 1/2\r\ncups shredded cooked chicken or turkey@2\r\ncups frozen mixed vegetables, thawed","step":"Heat oven to 425°F. Prepare pie crusts as directed on box for Two-Crust Pie using 9-inch glass pie pan.@In 2-quart saucepan, melt butter over medium heat. Add onion; cook 2 minutes, stirring frequently, until tender. Stir in flour, salt and pepper until well blended. Gradually stir in broth and milk, cooking and stirring until bubbly and thickened.@\r\nStir in chicken and mixed vegetables. Remove from heat. Spoon chicken mixture into crust-lined pan. Top with second crust; seal edge and flute. Cut slits in several places in top crust.@\r\nBake 30 to 40 minutes or until crust is golden brown. During last 15 to 20 minutes of baking, cover crust edge with strips of foil to prevent excessive browning. Let stand 5 minutes before serving.","rank":"","__v":0},{"_id":"6447318301769ebc720011cb","recipe":"Meatball Sub","serving":"4","time":"65","calorie":"829","protein":"52","carb":"37","fat":"52","image":"https://www.simplyrecipes.com/thmb/uPspgGtGWy9v-qFRBVw1kK918jA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Meatball-Sub-LEAD-02-a3c4937829374ce5bce7facc6f2cdfc9.jpg","website":"https://www.simplyrecipes.com/meatball-sub-recipe-7108244","ingredient":"For the meatballs@@1/3 cup whole milk, warmed@1 slice white bread, crumbled@1 pound ground beef (80 to 85% lean)@1/4 cup freshly grated Parmesan cheese@1 large egg@1/2 tablespoon fresh chopped parsley@1 teaspoon kosher salt@1/2 teaspoon dried oregano@1 cup Italian breadcrumbs, for coating@1/3 cup olive oil, for searing@24 ounces good quality marinara sauce@@For the subs@@4 large hoagie rolls, 6 to 8 inches long@1 tablespoon butter or olive oil@8 slices provolone cheese@Fresh basil, for garnish@Banana peppers, for garnish (optional)","step":"Prepare the meatball mixture: \r\nAdd the warm milk to a large bowl with the crumbled bread and let soak for a minute or two.  Then add the ground beef, Parmesan cheese, egg, parsley, salt, and oregano. Mix with your hands until combined; it’s okay if there are a few bread chunks still.@Shape the meatballs: \r\nUsing wet hands, shape the mixture into about 16 even meatballs—each should be around 1 ounce, or 1 1/2 inches in diameter. Coat each meatball in breadcrumbs and set it on a baking sheet while you shape the rest of the meatballs.@Sear the meatballs: \r\nAdd the olive oil to a large skillet over medium heat. Once it’s glistening hot, add the meatballs, searing for a few minutes on every side. Once seared, transfer the meatballs to a medium saucepan and add the marinara sauce.@Simmer the meatballs: \r\nPlace the saucepan over medium heat and bring to a simmer. Add up to 1 cup of water to the pot if the marinara sauce seems too thick. Once the sauce is simmering, turn the heat down to low and cover with the lid, leaving it ajar so some steam can escape. Simmer until the meatballs are cooked through and the sauce has thickened, about 30 minutes. @Assemble and bake the meatball subs: \r\nPreheat the oven to 450˚F. \r\n\r\nHeat a skillet or griddle over medium-high heat. Using a bread knife, slice the hoagie rolls down the center, leaving the two sides attached, and open them up like a book. Add a little butter or drizzle of oil to the skillet and add the rolls cut side down. Cook until the hoagies are toasted, about 2 minutes. You will likely need to toast them 1 or 2 at a time, depending on the size of your skillet.\r\n\r\nScoop 4 meatballs out of the marinara sauce and chop them in half. Add them to a toasted hoagie and spoon about 1/2 cup of sauce over the top of the meatballs. Top with 2 slices of provolone. Repeat with the remaining rolls and meatballs.\r\n\r\nBake the hoagies until the cheese is well melted, about 5 minutes. Top with basil and banana peppers, if desired. Serve immediately.  ","rank":"","__v":0},{"_id":"644731ca01769ebc720011cf","recipe":"Classic Chocolate Eclairs","serving":"24","time":"100","calorie":"94","protein":"2","carb":"6","fat":"7","image":"https://therecipecritic.com/wp-content/uploads/2023/02/eclairs-2-300x300.jpg","website":"https://therecipecritic.com/eclairs/","ingredient":"Shell Dough@@½ cup milk@½ cup water@½ cup unsalted butter@1 tablespoon granulated sugar@½ teaspoon salt@1 cup flour@4 large eggs room temperature@@Filling@@3.4 ounce box vanilla pudding prepared as directed on the box@8-ounce container whipped topping thawed@@Ganache@@⅓ cup semi sweet chocolate chips@⅓ cup heavy cream","step":"Shells@@Preheat the oven to 425 Fahrenheit. Line two baking sheets with parchment and set aside@Add the milk, water, butter, sugar and salt to a medium saucepan and cook over medium-low heat until the butter is melted and the edge of the mixture is bubbling.@Remove from the heat and add the flour. Mix until a thick paste forms. Turn the heat back on to medium and stir for 2 minutes.@Remove from the heat and transfer the dough to a bowl. Using a stand mixer fitted with the paddle attachment or a hand mixer, beat the dough for 1-2 minutes to bring the temperature down.@Add the eggs one at a time, being sure to fully mix in each egg before adding the next. The dough should be thick and glossy.@Fill a pastry bag ⅔ of the way with dough. Either pre-fir the bag with a large round piping tip or snip ½ inch off the end of the bag. Pipe 4 inch lines of dough on the parchment lines baking sheets, leaving 2 inches between them.@Bake for 10 minutes at 425 Fahrenheit before lowering to 325 and baking for 25-30 minutes more. Remove from the oven and let cool completely.@@Filling@@Prepare the pudding as directed on the package.@Once the pudding has set, fold in the whip topping.@Transfer the filling to a piping bag fitted with a #8-#10 round piping tip. Use the tip to gently poke 2 holes in the bottom off the eclairs and gently squeeze the filling inside, being careful to not overfill.@@Ganache@@Add the chocolate chips to a bowl.@Heat the cream for 30-40 seconds in the microwave, until steaming. Pour over the chocolate and let sit for 3-4 minutes. Stir until smooth.@Dip the tops of the filled eclairs into the Ganache and let them sit until the Ganache sets.","rank":"","__v":0},{"_id":"644731e801769ebc720011d3","recipe":"Chicken Caesar Wrap","serving":"4","time":"20","calorie":"434","protein":"20","carb":"34","fat":"24","image":"https://www.simplyrecipes.com/thmb/8R8A-utzgIsl2gZ-P38Lu5fAKJU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Chicken-Caesar-Wrap-LEAD-2-15381bd50c2a4c0e9b5f1f787d4a9a7f.jpg","website":"https://www.simplyrecipes.com/chicken-caesar-wraps-recipe-6279136","ingredient":"1 1/2 cups chopped cooked chicken@2 cups chopped romaine lettuce@1/3 cup Caesar dressing@1/4 cup freshly grated Parmesan cheese@1/2 cup croutons@Salt@Black pepper@4 large (10-inch) flour tortillas","step":"Make the salad: \r\nIn a large bowl, add the chicken, lettuce, Caesar dressing, Parmesan cheese, and croutons. Toss until everything is evenly coated in the dressing. Taste and season with salt and black pepper, if needed.@Wrap the salad:\r\nPlace a tortilla flat on a cutting board or clean work surface. Add a quarter of the salad in the center of the tortilla. Fold the left and right edges in towards the center, then tuck the side closest to you up and roll it tightly. Secure it with a toothpick, if you’d like. You could also keep the wrap seam side-down so that it doesn’t unroll. Assemble the remaining 3 wraps just like this.@Serve:\r\nCut the wraps in half or serve them whole. The chicken Caesar wraps can be wrapped in plastic wrap, parchment paper, or foil, and refrigerated for up to 2 days.","rank":"","__v":0},{"_id":"6447320401769ebc720011d7","recipe":"Old Bay Shrimp Rolls","serving":"4","time":"40","calorie":"772","protein":"35","carb":"50","fat":"48","image":"https://www.simplyrecipes.com/thmb/XsrD6OOXKqYFVWgeYLrq4Km5qiE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Shrimp-Rolls-LEAD-04-b424f4a3955a458ca5ddefb422bdebbb.jpg","website":"https://www.simplyrecipes.com/old-bay-shrimp-rolls-recipe-5547714","ingredient":"For the crispy shallots@@2 cups thinly sliced shallots (from 3-4 large shallots)@1 1/4 cups  vegetable or canola oil@1/4 teaspoon kosher salt, divided@@For the lemony chive mayo@@1/2 cup mayonnaise@2 tablespoons lemon juice@2 tablespoons minced chives, plus more for garnish@1 teaspoon grated garlic@1/4 teaspoon cracked black pepper@1/2 teaspoon kosher salt@@For the shrimp rolls@@1 pound large (26/30 count) shrimp, peeled, deveined, and tails removed@1 tablespoon olive oil@1 tablespoon Old Bay seasoning@2 tablespoons softened, unsalted butter@4 top-split (or “New England-style”) hot dog buns@1 head of butter or Bibb lettuce","step":"Fry the crispy shallots:\r\nLine a plate with paper towels before you begin frying the shallots.\r\n\r\nAdd the thinly sliced shallots and oil to a small saucepan and place over medium heat. Bring the shallots and oil to a boil, then reduce heat to medium-low. Let the oil simmer for 15-20 minutes, stirring every 2-3 minutes, or until the bubbling fades and the shallots begin to turn a pale golden color.@Drain the shallots:\r\nOnce the shallots start to brown, stir constantly for about 1 minute or until they’re uniformly golden. Use a slotted spoon to remove them onto a paper towel-lined plate and spread them out evenly. Sprinkle with kosher salt and set aside.@Make the lemony chive mayo:\r\nIn a small bowl, whisk together the mayonnaise, lemon juice, chives, garlic, black pepper, and kosher salt until smooth. Reserve until ready to assemble the shrimp rolls.@Season the shrimp:\r\nPat the shrimp completely dry with paper towels and add to a large mixing bowl. Drizzle with olive oil and sprinkle with the Old Bay seasoning. Use your hands or a spoon to make sure each shrimp is evenly coated.@Sear the shrimp:\r\nPlace a large nonstick skillet over high heat. When hot, add the seasoned shrimp in one even layer, without any additional oil. Sear the shrimp for 1 minute, or until they’ve begun to turn pink at the edges. \r\n\r\nUse tongs to turn them and sear the second side for another minute, or until the shrimp are just cooked through and curled. \r\n\r\nRemove the shrimp to a plate and reserve until ready to assemble.@Toast the buns:\r\nWipe out the skillet and place over medium heat. Spread the softened butter on the outside edges of the top-split hot dog buns. Place the buns in the skillet and toast for 2-3 minutes on each side, or until golden brown and crisp. Remove to a serving platter.@Assemble the shrimp rolls:\r\nLine the inside of each toasted bun with 2 leaves of butter lettuce and top each with 1/4 of the seared shrimp. Drizzle with the lemony chive mayo, and sprinkle generously with the crispy shallots and reserved chives. \r\n\r\nServe warm, with plenty of napkins.","rank":"","__v":0},{"_id":"6447322601769ebc720011db","recipe":"BLT Wraps","serving":"6","time":"30","calorie":"725","protein":"24","carb":"76","fat":"35","image":"https://www.simplyrecipes.com/thmb/abeceYq_3vSUoM9dEv5X6ytZt6I=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-BLT-Wraps-LEAD-01-232d13b9374c45eca406ebc3564bf4fe.jpg","website":"https://www.simplyrecipes.com/blt-wraps-recipe-5524667","ingredient":"@@1 pound bacon@1 head butter lettuce, leaves roughly chopped@3 small ripe tomatoes, sliced@6 large burrito-size tortilla wraps@@For the easy chive mayo@@1/2 cup mayo@2 tablespoons thinly sliced fresh chives@1 tablespoon lemon juice@1/2 teaspoon garlic powder@1/8 teaspoon kosher salt","step":"Preheat oven to 375˚F.@Cook the bacon: \r\nArrange the bacon on a few baking sheets with foil or elevate them on a wire rack, making sure the bacon is not overlapping.\r\n\r\nBake the bacon for 15-20 minutes until it’s browned and crispy. Then remove the bacon from the baking sheet and let it drain on a few paper towels.@Make the chive mayo: \r\nIn a medium bowl combine the mayo, chives, lemon juice, garlic powder, and salt. Set aside.@Assemble the wraps:\r\nSpread about 2 tablespoons of the chive mayo onto your wrap. Then layer with butter lettuce, tomato slices, followed by 3-4 strips of crispy bacon. \r\n\r\nFold the edges over on the wrap and roll it into a tight cylinder. Cut the wrap in half for easier eating.\r\n\r\nContinue until all wraps are assembled.@Packing the wrap for lunch: \r\nRoll the wrap tightly in foil and keep it in the fridge until you leave. I like to pack the wraps in a bag with a cold pack, but they are fine wrapped up for a few hours also. I think the wrap is best when the lettuce is nice and crispy and cold. \r\n\r\nWrap ingredients all keep well in the fridge for 1 week. Make wraps on the day you are eating them!","rank":"6","__v":0},{"_id":"6447324401769ebc720011df","recipe":"Chopped Cheese","serving":"6","time":"30","calorie":"859","protein":"41","carb":"51","fat":"53","image":"https://www.simplyrecipes.com/thmb/MvRyfyqdbiQW4KW9QzTEu6l9jqk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Chopped-Cheese-LEAD-01-7beb07504ca14a8cb9a330dc5ac2028d.jpg","website":"https://www.simplyrecipes.com/chopped-cheese-recipe-6825969","ingredient":"2 pounds (80/20 blend) ground beef@1 white onion, chopped@4 clove garlic, chopped@1 teaspoon kosher salt@1/2 teaspoon black pepper@1 tablespoon Worcestershire sauce@6 hoagie or bolillo rolls@12 slices American cheese@6 tablespoons mayonnaise@Shredded iceberg lettuce, for serving@Tomato slices, for serving","step":"Cook the ground beef:\r\nAdd your ground beef to a large, dry pot or skillet over medium-low heat. Slowly cook so the fat renders out. Stir regularly, breaking up the beef as it cooks, until it is in crumbles but not fully cooked (some of the meat will still be pink). @Add the onions, garlic, and seasoning:\r\nOnce the beef is browned and most of the fat has rendered out (about 7-8 minutes of cooking), turn the heat up to medium and add onions and garlic. Cook for another 4-5 minutes until vegetables soften. Season the filling with salt, pepper, and Worcestershire sauce. Remove from heat.@Toast the buns: \r\nSlice your rolls in half and toast them in batches over a griddle or in a large skillet over medium heat until browned.@Combine the cheese and ground beef: \r\nFor each sandwich, portion out about 1/6 of the beef filling at a time and add to the griddle or skillet over medium-low heat. Let the filling get hot and then cover it with two slices of American cheese. Let it sit long enough got the cheese to melt. If you like, roughly “chop” the cheese into the beef mixture with the side of a metal spatula.@Place the roll on the ground beef:\r\nAdd 1 tablespoon of mayo to one side of your toasted roll and cover the beef filling with a toasted roll, by placing the roll, toasted side down, on top of the chopped beef mixture.@Finish the sandwich and serve: \r\nAfter 30 seconds, use a spatula to flip the roll, keeping the filling inside. If any filling falls out, use the spatula to add it back to the roll. Repeat as needed to make other sandwiches.\r\n\r\nAdd shredded lettuce and sliced tomato to the sandwich. Cut in half and serve immediately. \r\n\r\nLeftover chopped cheese filling can be stored in the fridge in an airtight container for 3-4 days. You can add the filling straight from the fridge to a griddle to make a sandwich. \r\n\r\nOnly make as many sandwiches as you need to, but if you have leftover filling, that’s great! ","rank":"","__v":0},{"_id":"6447326b01769ebc720011e3","recipe":"Italian Grilled Cheese Sandwiches","serving":"4","time":"30","calorie":"659","protein":"37","carb":"33","fat":"42","image":"https://www.simplyrecipes.com/thmb/KTpB34vpFthMuxyx_vBBTqh3-xQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__05__EYF-Italian-Grilled-Cheese-LEAD-4-7052fb3d52574c4dad77dc2f28d72256.jpg","website":"https://www.simplyrecipes.com/recipes/italian_grilled_cheese_sandwiches/","ingredient":"For the sandwiches@@8 slices sandwich bread@8 slices provolone cheese@4 ounces Genoa salami@4 ounces prosciutto@2 ounces pepperoni@1/2 cup fresh basil leaves, loosely packed@2 tablespoons butter@@For the DAD ADD: Olive and cauliflower giardiniera@@1 cup hot pickled cauliflower, chopped@1/2 cup green olives(Castelvetrano), chopped@1/4 cup banana peppers","step":"Make the Dad Add (optional):\r\nChop the ingredients to roughly the same size, and stir them together in a bowl. Done!@Prepare the sandwiches:\r\nAdd a slice of provolone to a piece of bread. Top with a layer of salami, prosciutto, and pepperoni. Divide the meat evenly among the four sandwiches.\r\n\r\nTop meat with a handful of fresh basil leaves and a second piece of provolone cheese. Add second piece of bread and press down slightly to keep the sandwich together.@Grill that cheese:\r\nPreheat a large skillet over medium-low heat. Once warm, add about 1/2 tablespoon of butter per sandwich you are cooking. Usually, I cook two at a time. When the butter has melted, add the sandwich and coat the bread with the melted butter, then flip and coat the second side as well.\r\n\r\nLet sandwiches cook over medium-low heat for about 3 to 4 minutes per side, making sure they don’t get too browned. After about 6 to 8 minutes total, the cheese in the sandwich should be well melted and the bread toasted. Done!\r\n\r\nRepeat the process for the last two sandwiches. I like to serve the first two to kids while I make the last two for adults, but you can also keep the first two warm in a 200°F oven while you make the last two.@Serve:\r\nServe sandwiches with chips, salad, steamed veggies, and/or giardiniera.","rank":"","__v":0},{"_id":"6447328801769ebc720011e7","recipe":"Beef Enchilada Casserole","serving":"7","time":"65","calorie":"805","protein":"55","carb":"57","fat":"39","image":"https://www.simplyrecipes.com/thmb/e8RDluVSC-c3LZvcoO8EGDrPWzA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Beef-Enchilada-Casserole-LEAD-02-ad4ba62363a44a85b8f281a806697f44.jpg","website":"https://www.simplyrecipes.com/beef-enchilada-casserole-recipe-7097530","ingredient":"@@2 pounds (908g) ground chuck@1/2 medium white onion, diced (about 1 cup)@3 cloves garlic, minced (about 1 tablespoon)@1/2 jalapeño, deseeded and minced (about 1 tablespoon), optional@2 (1-ounce) packets taco seasoning, or 56 grams (1/2 cup)@1/2 teaspoon kosher salt@1/2 cup (237ml) beef stock or water@1 (15-ounce) can (425g) black beans, rinsed and drained@3 1/2 cups red enchilada sauce (canned or homemade)@18 to 24 (4.5-inch) corn tortillas@1 pound (454g) Monterey Jack cheese, shredded (about 5 cups, lightly packed)@@Optional toppings@@Sour cream@Chopped cilantro@Sliced jalapeños ","step":"Preheat the oven 350°F (177°C)@Brown the meat:\r\nAdd the ground chuck to a 12-inch skillet. Bring the skillet up to medium heat. While the skillet is heating up, use a spoon to break apart the meat. Brown the meat, stirring occasionally, for 6 to 7 minutes. Once the meat is no longer pink, spoon off and discard the grease.@Sauté the vegetables and season the meat: \r\nAdd the onions, garlic, and jalapeño to the beef and continue cooking over medium-high heat until the onions are translucent, about 6 minutes. \r\n\r\nSprinkle the taco seasoning and kosher salt over the mixture in the pan. Next, add the beef stock (or water) to the pan and stir until the meat mixture is evenly coated.\r\n\r\nFinally, add the drained black beans to the skillet and stir to combine.@Layer the casserole: \r\nPour 2 1/2 cups of the enchilada sauce into a pie dish or wide, shallow bowl. One at a time, dip corn tortillas into the enchilada sauce in the bowl, ensuring each is evenly coated in the sauce. Line the bottom of a 9x13-inch casserole dish with the dipped tortillas, overlapping them slightly to completely cover the bottom of the baking dish. Sprinkle 3/4 cup of the shredded cheese over this layer of tortillas.\r\n\r\nSpoon half of the ground meat mixture over the cheese in an even layer. Top the beef with another 3/4 cup of cheese. \r\n\r\nRepeat the layering process by dipping more tortillas, sprinkling about 1 cup of cheese, the remaining beef mixture, and another 1 cup of cheese. Top with the remaining tortillas dipped in the enchilada sauce. \r\n\r\nPour the remaining enchilada sauce from the bowl over the top of the assembled casserole. If you prefer a saucier casserole, pour an additional 1/2 cup of sauce over the entire casserole in the pan.\r\n\r\nSprinkle the remaining cheese over the surface of the enchilada casserole.@Bake the casserole: \r\nCover the baking dish with aluminum foil and bake the casserole for 25 minutes.\r\n\r\nCarefully remove the foil and bake until the cheese is completely melted and starting to bubble, another 10 to 12 minutes.@Cool and garnish: \r\nAllow the casserole to cool on the countertop for 10 to 15 minutes. \r\n\r\nCut the casserole into 8 squares. Serve the beef enchilada casserole garnished with sour cream, chopped cilantro, and jalapeño slices. \r\n\r\nStore cooled enchilada casserole leftovers in a covered container in the refrigerator for up to 3 days.","rank":"","__v":0},{"_id":"644732a601769ebc720011eb","recipe":"Philly Cheesesteak","serving":"2","time":"30","calorie":"1638","protein":"82","carb":"158","fat":"75","image":"https://www.simplyrecipes.com/thmb/npHxyIf0n6THn5nW2Vdiabi5gyc=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Philly-Cheesesteak-LEAD-2-b182ca21d19344159d44efd361db1477.jpg","website":"https://www.simplyrecipes.com/philly-cheesesteak-recipe-5188498","ingredient":"10 to 12 ounces ribeye steak@1/2 teaspoon kosher salt@1/2 teaspoon black pepper@2 tablespoons olive oil@1/2 medium sweet onion, sliced@1/2 green bell pepper, sliced@1/2 red bell pepper, sliced@2 ounces (3 slices) provolone cheese@2 hoagie rolls, toasted@1/4 cup Cheez Whiz, warmed@Fresh thyme, for garnish, optional","step":"Freeze and slice the steak:\r\nPlace steak in the freezer on a sheet pan for about 10 minutes so it gets very cold but not frozen through.\r\n\r\nTrim off any large pieces of fat normally around the edges of the steak, but some veins of fat in the middle of the steak are good. Slice the steak as thin as possible with a sharp knife. You won’t be able to get it paper thin without a meat slicer, but think of thick deli cut meat. Season steak with salt and pepper.@Cook the onions and peppers:\r\nIn a large skillet set over medium heat, add 1 tablespoon of olive oil along with sliced onions and peppers. Season with 1/4 teaspoon salt and pepper. Cook, stirring occasionally, until the onions and peppers have softened and start to caramelize around the edges, 12 to 15 minutes. Don’t rush them!@Cook the steak:\r\nHeat a griddle or large skillet over medium-high heat. Add the remaining 1 tablespoon of olive oil and the sliced steak. Spread out the steak in the skillet in a thin even layer so it covers as much surface area as possible. Cook for a minute or two and then stir to finish cooking the steak. It might need another minute or two, but it will cook very quickly.@Finishing the cheesesteak:\r\nTurn heat down to low on the steak and add the peppers and onions to the steak mixture and stir to combine. Add the provolone slices to the top of the steak mixture and let the cheese melt. Stir to combine, once the cheese has melted.@Assemble the cheesesteaks and serve:\r\nEvenly scoop the cheesesteak mixture into the toasted hoagie rolls. The hoagie rolls should be packed! Optionally, drizzle the cheesesteaks with warm Cheez Whiz for maximum cheesiness. Sprinkle fresh thyme over top and serve.","rank":"","__v":0},{"_id":"644978765b688aadf1043d50","recipe":"Hawaiian Roll Sliders with Meat Sauce and Parm","serving":"7","time":"40","calorie":"656","protein":"38","carb":"46","fat":"35","image":"https://www.simplyrecipes.com/thmb/bzNyuTGf6_PQs3pMxRgDpMgLy0I=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Meatball-Parm-Sliders-LEAD-2-4fc131e9c1ef453b88d67458b5e20c06.jpg","website":"https://www.simplyrecipes.com/hawaiian-roll-sliders-meat-sauce-and-parm-recipe-6744598","ingredient":"Nonstick cooking spray@5 cloves garlic, grated @1/2 cup (1 stick) unsalted butter@2 1/2 teaspoons garlic powder, divided @2 teaspoons kosher salt, plus more for garlic butter@1/2 teaspoon freshly ground black pepper, plus more for garlic butter@1 (12-count) package King's Hawaiian sweet rolls @1 medium onion, diced (about 1 1/2 cups)@1 1/2 pounds ground beef (85% lean)@2 tablespoons Italian seasoning@1 (6-ounce) can tomato paste@1 cup water@8 ounces sliced low-moisture mozzarella cheese (about 8 slices)","step":"Preheat the oven to 425ºF.\r\nLine a baking sheet with foil and spray it lightly with nonstick cooking spray.@Make the garlic butter:\r\nTo a small heatproof bowl, add the butter, about two-thirds of the garlic, 1 1/2 teaspoons garlic powder, and a pinch each of salt and freshly ground black pepper. Microwave until the butter has fully melted, in 30-second intervals, stirring after each.@Prepare the rolls:\r\nUsing a serrated knife, cut the rolls horizontally in half, dividing the tops and bottoms while keeping the rolls connected. Place them on the prepared baking sheet and brush each inside with about two-thirds of the garlic butter. You’ll use the remaining garlic butter to brush the top of the rolls after assembling.@Toast the rolls:\r\nToast the rolls in the oven until golden brown and slightly dried out, 5 to 7 minutes. Set them aside to cool while you make the filling.@Toast the rolls:\r\nToast the rolls in the oven until golden brown and slightly dried out, 5 to 7 minutes. Set them aside to cool while you make the filling.\r\n\r\nCook the filling:\r\nMeanwhile, heat a large skillet over medium-high heat. Add the onions and 1/2 teaspoon salt. Cook 5 to 7 minutes, stirring frequently, until golden around the edges. Stir in the remaining grated garlic and cook for 30 seconds.\r\n\r\nThen, add the ground beef and increase heat to high heat. Season with the remaining 1 1/2 teaspoons salt, 1 teaspoon garlic powder, Italian seasoning, and black pepper. Stir well, breaking up the beef into small pieces. Cook until the meat is no longer pink and some moisture has evaporated but the fat remains, about 8 minutes.@Add the tomato paste: \r\nLower heat to medium-high heat and stir in the tomato paste. Cook until the tomato paste is jammy and slightly darkened, stirring frequently, about 5 minutes. Add 1 cup of water, stir well until fully combined, and turn off heat.@Assemble the sliders:\r\nEvenly layer half the sliced cheese on the bottom rolls, making sure to fully cover the bread—the cheese will act as a barrier to keep the rolls from getting soggy. Spread the filling over the cheese and then, top it with a layer of the remaining cheese. Top with the other half of rolls.\r\n\r\nBrush the tops with the remaining garlic butter, and bake again until the cheese is melted and the sliders are deeply golden, about 3 minutes.@Serve the sliders: \r\nAllow the sliders to cool slightly before serving. Tear or cut individual sliders off and serve warm.\r\n\r\nStore any remaining sliders in the fridge tightly covered. Leftovers will keep for up to 5 days. Reheat in the microwave for 30 seconds—add 15 seconds for each additional slider. To reheat in the oven, bake for 8 to 10 minutes at 350°F, until the cheese has melted and the sliders are crisp and heated through.","rank":"2","__v":0},{"_id":"644978b15b688aadf1043d54","recipe":"Classic Meatloaf","serving":"5","time":"100","calorie":"713","protein":"49","carb":"30","fat":"44","image":"https://www.simplyrecipes.com/thmb/0dyWIJRqLguhfwOvv02FHZMQlpE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2014__09__classic-meatloaf-horiz-a-1500-051df66acbd04e6995e1170869a4e22b.jpg","website":"https://www.simplyrecipes.com/recipes/classic_meatloaf/","ingredient":"2 tablespoons unsalted butter@1 cup finely chopped onion@1 rib celery, finely chopped@1 carrot, finely chopped@1/2 cup finely chopped green onion@3 cloves garlic, minced (about 1 tablespoon)@1 1/2 teaspoon salt@1/2 teaspoon freshly ground black pepper@2 teaspoons Worcestershire sauce@2/3 cup ketchup, divided@1 1/2 pounds ground beef chuck@3/4 pound sweet ground Italian sausage, or a mix of sweet and hot Italian sausage if you are using links @2 large eggs, slightly beaten@1 cup fresh breadcrumbs@1/3 cup minced fresh parsley","step":"Preheat the oven to 350°F.\r\nPosition a rack in the middle of the oven.@Cook the vegetables, season, and add Worcestershire and half the ketchup:\r\nMelt the butter in a large, thick-bottomed skillet, on medium heat. When the butter starts to foam, add the finely chopped onions, celery, carrot, green onions and garlic to the pan and cook for 5 minutes, stirring occasionally.\r\n\r\nCover the pan and cook for another 5 minutes, until the carrots are tender, stirring every so often.\r\n\r\nSprinkle with salt and pepper. Add the Worcestershire sauce and 1/3 cup ketchup. Cook for another minute and remove from heat to cool.@Make the meatloaf mixture:\r\nOnce the vegetables have cooled to the touch, place them in a large bowl with the ground beef, Italian sausage, eggs, breadcrumbs and parsley. Use your (very clean) hands to mix them together until everything is evenly distributed.@Place in the loaf pan, cover with remaining ketchup:\r\nPlace the meatloaf mixture into a loaf pan (either 4-x 8-inch or 5- x 9-inch) and press to make compact in the pan. Or you can form a free-standing loaf onto a rimmed baking pan. Cover the meatloaf mixture with the rest of the ketchup.@Bake:\r\nBake for 1 hour at 350°F, or until a meat thermometer inserted into the center of the meatloaf reads 155°F.\r\n\r\nRemove from oven and let sit for 10 minutes. Then use a metal spatula to gently lift the meatloaf out of the loaf pan to a serving plate.@Serve:\r\nCut into thick slices to serve. The meatloaf makes great leftovers, just chill and reheat. Slices are good in sandwiches as well.","rank":"","__v":0},{"_id":"644978c95b688aadf1043d58","recipe":"Eggnog Pound Cake","serving":"18","time":"90","calorie":"304","protein":"4","carb":"46","fat":"11","image":"https://www.simplyrecipes.com/thmb/5c8XrLMzGzJJ7Fuwkm2w4Yqua2s=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2007__12__eggnog-poundcake-horiz-a-1600-b6b4b178d6bb4a95a7f1e13032f08b4b.jpg","website":"https://www.simplyrecipes.com/recipes/eggnog_pound_cake/","ingredient":"For the cake:@@3/4 cup sweetened dried cranberries, chopped@1 tablespoon orange zest@4 tablespoons brandy (can sub orange juice or water)@3 cups all-purpose flour@2 teaspoons baking powder@1/2 teaspoon kosher salt@1/2 teaspoon nutmeg@1/4 teaspoon cinnamon@1/4 teaspoon allspice@1 cup (2 sticks) unsalted butter@2 cups white granulated sugar@5 large eggs, room temperature@1 cup eggnog@1 teaspoon vanilla extract@2 to 4 tablespoons brandy for drizzling on the cake (optional)@@For the glaze:@@1 to 2 tablespoons orange juice@1 tablespoon brandy or dark rum@1 cup powdered sugar","step":"Soak the cranberries:\r\nSoak dried chopped cranberries and orange zest in brandy in a small bowl for 15 minutes.@Preheat the oven:\r\nAdjust rack to lower third of oven. Preheat the oven to 325°F. Generously butter the inside of a 9 to 10 inch bundt pan.@Mix the dry ingredients:\r\nIn a bowl, whisk together flour, baking powder, salt, nutmeg, cinnamon, and allspice.@Cream the butter and sugar:\r\nUsing an electric mixer on medium speed, beat butter until creamy, 30 to 45 seconds. Add sugar and beat until light and fluffy, about 5 minutes. Scrape bowl with a rubber spatula occasionally as needed. Add eggs one at a time, beating 1 minute after each addition. Add the vanilla extract.@Add the dry ingredients and eggnog to mixture:\r\nRemove the mixing bowl from the mixer and use a rubber spatula to gently add the dry ingredients in 4 additions, alternating with eggnog (begin and end with dry ingredients). Gently fold in orange zest, dried cranberries and any remaining brandy.@Bake:\r\nSpoon the batter into the prepared bundt pan and spread evenly. Bake at 325°F 55 to 60 minutes, or until cake springs back when touched lightly in the center and pulls away from the sides of the pan. You can also use a bamboo skewer and insert into the thickest part of the cake. If it comes out clean, it's done.@Cool:\r\nRemove from oven and cool upright in the pan on a rack for 10 minutes. Invert cake onto a rack while the cake is still warm. Let cool completely.@Prepare the glaze:\r\nOnce the cake has completely cooled, prepare glaze by whisking together powdered sugar, orange juice, and brandy. (You can sub the brandy with more orange juice or water if you want.)\r\n\r\nMake the glaze thick if you would like a thick, pronounced drizzle, or make it more thin if you want a glaze that is somewhat translucent.@Glaze the cake:\r\nPlace cake on serving platter. Poke a few holes in the top and drizzle with brandy if you want. Use a spoon to stream the glaze onto the cake in back and forth motions to create a striped pattern. Or, if the glaze is thin enough, you can use a pastry brush to brush on the glaze.","rank":"","__v":0},{"_id":"644978ee5b688aadf1043d5c","recipe":"Banana Sheet Cake","serving":"30","time":"50","calorie":"176","protein":"2","carb":"25","fat":"8","image":"https://www.simplyrecipes.com/thmb/simruVnGHjhHFUwa1oTcGimgMXY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Banana-Sheet-Cake-RESHOOT-LEAD-03-fc53f3599249458894533f88838d113e.jpg","website":"https://www.simplyrecipes.com/recipes/banana_sheet_cake/","ingredient":"For the cake@@2 cups all-purpose flour@1 teaspoon baking soda@1 teaspoon cinnamon@1/2 teaspoon kosher salt@1/2 cup (1 stick) unsalted butter, room temperature@1 cup white granulated sugar@1/2 cup brown sugar@2 large eggs@1 vanilla bean (scraped clean, outside discarded), or 1 teaspoon vanilla extract@1 cup mashed ripe bananas (2 large or 3 medium bananas)@1/2 cup full fat sour cream@@For the frosting@@6 ounces cream cheese, room temperature@4 tablespoons (1/4 cup) unsalted butter, room temperature@2 cups powdered sugar@1 teaspoon vanilla extract@1 teaspoon lemon juice","step":"Preheat the oven to 350°F (175°C) .\r\nPlace the oven rack in the middle of the oven.@Whisk together the dry ingredients:\r\nIn a medium bowl, whisk together the flour, baking soda, cinnamon, and salt.@Beat together the butter, sugars, and eggs:\r\nIn a mixer, beat together butter and the sugars. Add eggs one at a time and beat.@Mix in the vanilla and bananas:\r\nAdd vanilla and bananas and beat until just mixed in.@Mix in the flour and sour cream:\r\nMix in half of the flour mixture, then the sour cream, then the other half of the flour mixture.@Spread the batter in baking pan:\r\nSpread batter evenly in a greased 10x15-inch baking pan. Bake at 350°F (175°C) for 20 minutes, or until nicely browned and the surface bounces back when you press it with your finger. Cool completely before frosting.@Make the frosting and frost the cake:\r\nTo make the frosting, mix all of the ingredients together with an electric mixer. If too stiff to spread, add a teaspoon or two of water.\r\n\r\nSpread the frosting evenly over the cake and slice to serve.","rank":"","__v":0},{"_id":"6449790c5b688aadf1043d60","recipe":"Butternut Squash Bread with Pecan Streusel","serving":"9","time":"125","calorie":"412","protein":"5","carb":"60","fat":"18","image":"https://www.simplyrecipes.com/thmb/uTpN6pPQ6oZdWvRPinG_gUX6lzU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Butternut-Squash-Bread-Pecan-Streudel-LEAD-01-89c114cfa4b24f5abf6edd0f3e15a107.jpg","website":"https://www.simplyrecipes.com/butternut-squash-bread-with-pecan-streusel-recipe-5206502","ingredient":"For the squash purée@@1 medium (about 2 1/2 pound) butternut squash@1 teaspoon canola or vegetable oil@@For the topping@@1/3 cup (70g) light brown sugar, packed@1/3 cup (46g) all-purpose flour@1/2 teaspoon ground cinnamon@1 pinch salt@3 tablespoons unsalted butter, melted@1/3 cup (42g) chopped pecans@@For the bread@@Nonstick cooking spray for the loaf pan@1/2 cup (100g) sugar@1/2 cup (105g) light brown sugar, packed@1/4 cup canola or vegetable oil@4 tablespoons unsalted butter, melted@2 large eggs@2 tablespoons water@1/2 teaspoon vanilla extract@1 1/2 cups (210g) all-purpose flour@1 teaspoon ground cinnamon@1/4 teaspoon ground nutmeg@3/4 teaspoon baking soda@1/4 teaspoon baking powder@1/2 teaspoon salt","step":"Roast the squash:\r\nPreheat the oven to 350°F with the oven rack set to the middle. Line a large, rimmed baking sheet with foil.\r\n\r\nCut the butternut squash in half lengthwise and scoop the seeds out using a large spoon. Rub both halves with the oil and place them cut-side down on the prepared baking sheet.\r\n\r\nRoast the squash until you can easily pierce the thickest part with a sharp knife, 40 to 50 minutes. Carefully flip over the squash and let it cool for 10 to 15 minutes.\r\n\r\nLeave the oven on.@Purée the squash:\r\nScoop out the flesh and add it to a food processor. Discard the peel. Purée the squash, scraping down the sides once or twice, until smooth. Measure out 1 cup (250g) for the recipe and store the rest for another use.\r\n\r\nReturn the 1 cup of squash to the food processor for the bread. Set this aside while you make the streusel.@Make the streusel:\r\nIn a small bowl, combine the brown sugar, flour, cinnamon, and salt. Using a spoon or rubber spatula, mix in the melted butter until a crumbly dough forms. Add the pecans and use your hands to toss and distribute evenly. Set it aside.@Prepare the loaf pan:\r\nSpray a 9x5-inch loaf pan with cooking spray and line the bottom and sides with a strip of parchment paper, forming a sling. Make sure the paper hangs over both sides—this will make removing the bread from the pan easier.@Mix the wet ingredients:\r\nTo the 1 cup of butternut squash purée in the food processor, add the sugar, brown sugar, oil, melted butter, eggs, water, and vanilla. Process to mix, scraping down the sides once.@Mix the dry ingredients:\r\nIn a large bowl, combine the flour, cinnamon, nutmeg, baking soda, baking powder, and salt. Whisk to break up any lumps.@Combine the wet and the dry:\r\nAdd the butternut squash mixture into the flour mixture. Use a rubber spatula or wooden spoon to mix just until combined. A few small lumps of flour are fine.@Assemble and bake the bread:\r\nScrape the batter into the prepared loaf pan. Sprinkle the streusel evenly over the top.\r\n\r\nBake it until well-risen and the streusel has browned, about 1 hour. A cake tester or toothpick inserted in the center all the way to the bottom should emerge clean without any liquid batter. A few crumbs are okay.@Cool and serve:\r\nLet the bread cool in the pan for 5 minutes. Use the parchment sling to lift it out and onto a cooling rack. Cool completely before serving.","rank":"","__v":0},{"_id":"644979255b688aadf1043d64","recipe":"Cherry Cake","serving":"9","time":"80","calorie":"401","protein":"6","carb":"50","fat":"21","image":"https://www.simplyrecipes.com/thmb/L7yO-riJouE0MKrkZrxZz9nEJqE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Cherry-Cake-LEAD-8-3fde9afdfced48dc8384562c2428ee1d.jpg","website":"https://www.simplyrecipes.com/cherry-cake-recipe-5197888","ingredient":"@@2 cups (240g) all-purpose flour, plus more for dusting@1 teaspoon baking powder@1/2 teaspoon salt@1 cup (2 sticks, 227g) unsalted butter, softened@1 1/4 cups (250g) granulated sugar@4 large eggs@1/2 teaspoon almond extract@2 1/2 cups (394g) fresh cherries, stemmed and pitted@@Special Equipment@@1 (10-inch) springform cake pan","step":"Preheat the oven and prepare the cake pan:\r\nPreheat the oven to 350°F.\r\n\r\nGrease a 10-inch springform cake pan with butter. Use your hands to dust the pan lightly with flour, then tap out any excess.@Combine the dry ingredients:\r\nIn a medium bowl, add the flour, baking powder, and salt. Whisk until combined.@Beat the butter and sugar:\r\nIn a large bowl, beat the butter and sugar with an electric mixer on medium-high speed until pale and fluffy, about 3 minutes.@Incorporate the eggs and extract:\r\nAdd the eggs, one at a time, beating until fully incorporated after each addition. Scrape down the bowl with a rubber spatula halfway through. The batter should be smooth, light, and fluffy. If the emulsion breaks after adding the eggs and the batter has separated, you can add a couple tablespoons of the flour and mix just until it becomes smooth again.\r\n\r\nAdd the almond extract and mix on low speed to combine.@Add the dry ingredients:\r\nBeat in the flour mixture on low speed, or gently fold it in with a rubber spatula, just until combined and no streaks of flour remain.@Transfer batter to the cake pan and add cherries:\r\nTransfer the batter to the prepared cake pan. Lightly press the pitted cherries into the batter, making a circular pattern. Don’t press them in too deep or the cake will envelop them while baking.@Bake the cake:\r\nBake the cake for about 1 hour, or until a toothpick inserted in the center of the cake comes out clean. The cake should be golden and will have risen around the whole cherries, which should still be visible on top.@Cool cake:\r\nRemove from the oven. Allow to cool in the pan for 10 to 15 minutes before unmolding. Let it cool completely on a wire rack before serving.","rank":"","__v":0},{"_id":"644979505b688aadf1043d68","recipe":"Vanilla Pound Cake","serving":"9","time":"90","calorie":"480","protein":"5","carb":"61","fat":"24","image":"https://www.simplyrecipes.com/thmb/EYvxz1ZzUdVkEVVoByyhQRqQhDE=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2018__06__Vanilla-Pound-Cake-LEAD-HORIZONTAL-9c7905cc0f964fc2a8c63322c6151251.jpg","website":"https://www.simplyrecipes.com/recipes/vanilla_pound_cake/","ingredient":"For the cake:@@1 1/2 cups sugar@1 cup unsalted butter@1 tablespoon vanilla extract@4 large eggs@2 cups all-purpose flour@@For the vanilla glaze@@3 tablespoons butter, melted@1 cup powdered sugar@2 teaspoons vanilla extract@2 to 3 tablespoons milk","step":"Prep the oven and pan:\r\nPreheat oven to 350°F. Butter and line an 8-inch loaf pan with parchment paper, creating a sling.@Beat the butter and sugar:\r\nIn a large bowl with an electric hand mixer or in the bowl of a stand mixer, beat sugar, butter, and vanilla extract on medium high speed until light and fluffy, about 8 minutes. Scrape down the bowl. Beat for another 30 seconds.@Beat in the eggs:\r\nAdd eggs one at a time, waiting until each egg is fully incorporated and scraping down the bowl before adding the next egg.@Mix in the flour:\r\nWith the mixer on low speed add in the flour and mix just until a batter is formed, but you still see some streaks of flour. Use a spatula to finish folding the dough together. It should be thick.@Bake the cake:\r\nScoop the batter into the prepared loaf pan and smooth the top. Bake for 60 to 70 minutes, or until a toothpick inserted in the center of the cake comes out clean.@Cool the cake:\r\nRemove the cake from the oven. Run a thin knife around the edges while still warm, then cool for 15 minutes in the pan before unmolding. Allow to cool completely on a wire rack.@While the cake cools, make the glaze:\r\nWhisk together the melted butter, sugar, and extract. Add the milk 1 tablespoon at a time until the glaze is a smooth, pourable consistency.@Glaze and serve:\r\nPour the glaze over cooled cake. The cake can be served immediately, or you can wait for the glaze to dry, then cover with plastic wrap and store on the counter for up to 5 days. The cake can also be tightly in plastic and frozen for up to three months.","rank":"3","__v":0},{"_id":"644979695b688aadf1043d6c","recipe":"Classic Coffee Cake","serving":"17","time":"80","calorie":"430","protein":"5","carb":"60","fat":"19","image":"https://www.simplyrecipes.com/thmb/Hd2fdSTS2br3R4twtnyGKGBWOmA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__04__Crumb_Coffee_Cake_hero2-0f13c24b23784a35b307c7ea953f7eb9.jpg","website":"https://www.simplyrecipes.com/recipes/classic_coffee_cake/","ingredient":"For the streusel topping:@@1 cup (180g) brown sugar, packed@1 cup (125g) all-purpose flour@1 teaspoon ground cinnamon@Pinch kosher salt@1/2 cup (113g) unsalted butter, softened@@For the cinnamon layer:@@1/4 cup (50g) sugar@1 tablespoon all-purpose flour@1/2 teaspoon ground cinnamon@@For the cake batter:@@3 cups (375g) all-purpose flour@2 1/4 cups (450g) sugar@3/4 teaspoon baking powder@1/2 teaspoon baking soda@1/2 teaspoon kosher salt@1 cup (226g) unsalted butter, softened@1 cup (230g) sour cream@1/4 cup whole milk@4 large eggs@1 tablespoon vanilla extract","step":"Preheat the oven and prep the pan:\r\nPreheat the oven to 350°F and butter or spray a 9 x 13-inch pan.@Make the streusel layer:\r\nIn a small bowl, combine the flour, brown sugar, cinnamon, and salt. Use a fork to mash the butter into the mixture until completely combined and crumbly. Set aside.@Make the cinnamon layer:\r\nIn another small bowl, combine the sugar, flour, and cinnamon. Set side, as well.@Begin making the batter:\r\nIn the bowl of your mixer, add the flour, sugar, baking powder, baking soda, and kosher salt. Using the paddle attachment for your stand mixer, stir on low to combine.\r\n\r\nAdd the softened butter and beat on medium-low speed for 2 to 3 minutes, or until all of the butter is mixed in, and the mixture resembles moist sand.@Combine the wet ingredients and finish the batter:\r\nIn a medium bowl, whisk together the sour cream, milk, eggs, and vanilla until combined. Add the mixture to the dry ingredients. Beat the batter on medium speed until you get a smooth batter. A few small lumps are totally fine.@Prepare the cake:\r\nSpread half of the batter into the prepared pan. Sprinkle the cinnamon-sugar layer over the top of the batter in an even layer. Spread the remaining batter over the top (this does require some patience since the batter likes to lift off the cinnamon-sugar layer). Top with the crumble mixture.@Bake the cake:\r\nBake for 55 minutes or until a toothpick inserted in the center comes out clean. Cool on a rack for 1 hour (or until the cake comes to room temperature) before serving.@Store the cake:\r\nYou can make this cake a day or two in advance. Remove the cake from the pan and cover with plastic wrap. Keep it on the counter at room temperature.\r\n\r\nTo freeze the cake, wrap it in plastic, followed by foil.","rank":"","__v":0},{"_id":"644979835b688aadf1043d70","recipe":"Apple Bread Pudding","serving":"11","time":"85","calorie":"459","protein":"7","carb":"57","fat":"23","image":"https://www.simplyrecipes.com/thmb/_I-G-uDynTlPrK_OjuFpdzRAtKo=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Apple-Bread-Pudding-LEAD-09-f23d31550311455c8a5a3b1e6a7fad10.jpg","website":"https://www.simplyrecipes.com/apple-bread-pudding-recipe-6500773","ingredient":"For the bread pudding@@1 pound brioche or challah bread, cut into 1-inch cubes@3 large apples, peeled and chopped into 1/2-inch pieces@1/2 cup light brown sugar@4 tablespoons unsalted butter@1 teaspoon vanilla extract@1 teaspoon cinnamon@1/4 teaspoon salt@2 1/2 cups whole milk@4 large eggs@1/2 cup sugar@@For the bourbon sauce@@1 cup light brown sugar@1/2 cup unsalted butter@1/4 cup heavy cream@3 tablespoons bourbon","step":"Preheat the oven to 350°F.\r\nGrease a 9 x 13-inch casserole dish.@Toast the bread:\r\nSpread the cubes of bread out evenly on a baking sheet. Bake in the oven until lightly toasted, about 10 minutes.@Make the apple filling:\r\nMeanwhile, add the diced apples, brown sugar, butter, vanilla, cinnamon, and salt to a medium saucepan over medium heat. Stir and cook until the apples are soft and the sugar is melted, about 5 minutes. Remove from heat and set aside.@Assemble the bread pudding:\r\nIn a large bowl, whisk together the milk, eggs, and sugar.\r\n\r\nAdd the bread cubes to the prepared casserole dish. Pour the apple filling on top. Using a large spoon or rubber spatula, toss the bread chunks and apple filling together until evenly distributed. Pour the egg and milk mixture on top. \r\n\r\nLet sit at room temperature for 15 minutes before baking so that the bread can soak up most of the liquid.@Bake:\r\nBake until the liquid has set and the bread on the surface of the casserole is golden brown, about 40 minutes. When the bread pudding is done baking, a sharp knife or toothpick inserted in the center should come out clean.@Make the sauce and serve:\r\nWhile the bread pudding is baking, prepare the sauce. Combine the brown sugar and butter in a small saucepan over medium heat. Stir until the brown sugar is melted, 4 to 5 minutes. \r\n\r\nAdd the heavy cream and continue to stir the mixture over heat for 1 to 2 minutes. Stir in the bourbon and let the sauce simmer for 1 minute. Remove from heat. As the sauce cools, mix it every 1 to 2 minutes to prevent the butter from separating.\r\n\r\nPour the sauce over the bread pudding and serve warm.\r\n\r\nIf you don’t plan to serve the entire bread pudding at once, consider adding the sauce to each individual serving. Store any leftover bread pudding and sauce separately in airtight containers in the fridge for up to 4 days.","rank":"","__v":0},{"_id":"644979a25b688aadf1043d74","recipe":"Homemade Apple Pie","serving":"8","time":"170","calorie":"460","protein":"5","carb":"75","fat":"17","image":"https://www.simplyrecipes.com/thmb/GyDxraVGP_Jnercgd95EzF6JHiU=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Homemade-Apple-Pie-LEAD-04-11db861782aa4ebdb5ef9948125ef0ef.jpg","website":"https://www.simplyrecipes.com/recipes/old_fashioned_apple_pie/","ingredient":"For the pie@@3 pounds good cooking apples such as Granny Smith, Jonagold, Golden Delicious, Fuji, or Braeburn (about 6 to 8 apples, depending on the size of your apples)@1 tablespoon lemon juice or apple cider vinegar@1/2 cup to 2/3 cup sugar, depending on how sweet you like your pie@3 tablespoons all-purpose flour@1/2 teaspoon ground cinnamon@1/4 teaspoon ground allspice@1/4 teaspoon ground nutmeg@1 tablespoon brandy, optional (if you have Calvados apple brandy, use it!)@1 teaspoon vanilla extract@1 double crust sour cream pie dough, OR all-butter crust, OR your favorite pie crust recipe@@For the egg wash@@1 large egg yolk@1 tablespoon cream","step":"Peel, core, and slice the apples:\r\nPeel, core and slice or roughly chop the apples into 1/4-inch to 1/2-inch slices or chunks.\r\n\r\nAs you cut your apple slices, add them to a large bowl and toss them with the lemon juice or apple cider vinegar to help keep them from turning brown.@Make the apple pie filling:\r\nCombine the sugar, flour and spices (allspice, nutmeg, cinnamon) in a bowl. Add the flour mixture to the apple slices and use your hands to distribute the flour through the apples so they are well coated.\r\n\r\nSprinkle with brandy (if using) and vanilla extract and stir to coat all the apples.@Preheat the oven to 375°F.\r\nPlace one oven rack in the lowest position and put a large rimmed baking sheet on it to catch any drippings from the pie. Position a second rack the next rung up (still in the lower third of the oven).@Roll out the dough and line the pie plate:\r\nRemove one disk of pie dough from the refrigerator. Let sit at room temperature for 5 to 10 minutes. Place disk on a lightly floured, clean, flat surface. Using a rolling pin, roll out the pie dough to a 12-inch circle, about 1/8-inch thick.\r\n\r\nAs you roll out the dough, check to make sure it isn't sticking. If and when it starts to stick, gently lift it up and sprinkle a little more flour on the table surface or on the pie dough to keep the dough from sticking.\r\n\r\nGently place the rolled out dough onto a 9-inch pie plate. Press down to line the pie dish with the dough.@Add the apple filling:\r\nArrange the apple slices in the dough-lined pie plate. Mound the apples in the center.@Roll out the top crust, place over apples, trim and crimp edges:\r\nRoll out the second disk of dough, again to 12-inches. Gently place the second round of pie dough over the apples. Trim excess dough with kitchen shears, leaving a 3/4 inch overhang from the edges of the pie pan.\r\n\r\nFold the dough under itself so that the edge of the fold comes right to the edge of the pan. Press the top and bottom dough rounds together as you flute edges using thumb and forefinger or press with a fork.@Brush with the egg wash and cut vents:\r\nPlace egg yolk and cream in a small bowl and use a fork to stir until well combined. Use a pastry brush to brush the egg wash over the top and fluted edges of the pie. Use a sharp knife to cut slits in the top of the pie crust for steam vents.@Bake:\r\nPlace pie on oven rack centered over the baking sheet on the rack below it to catch any drippings. Bake the pie at 375°F until crust begins to lightly brown, about 20 minutes, then reduce heat to 350°F.\r\n\r\nBake until the crust is golden brown and the juices are bubbling all over, an additional hour or up to another hour and a half, depending on the type of apples you are using. If you have an instant-read thermometer, it should read 200°F when inserted in the center of the pie.@Cool:\r\nTransfer the apple pie to a rack to cool for at least 1 hour. Serve slightly warm or at room temperature. Great with a side of vanilla ice cream.","rank":"5","__v":0},{"_id":"64497a645b688aadf1043d78","recipe":"Povitica","serving":"12","time":"280","calorie":"361","protein":"7","carb":"43","fat":"19","image":"https://www.simplyrecipes.com/thmb/V6_0sByLhfCNvyo1krRJbpm6bqg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Povitica-LEAD-6-9578d51c70374def8cb576bcf892a12e.jpg","website":"https://www.simplyrecipes.com/povitica-recipe-5270630","ingredient":"For the dough:@@2/3 cup (160ml) whole milk@2 tablespoons (30g) unsalted butter@2 1/2 cups (300g) all purpose flour@3 tablespoons (40g) granulated sugar@1 1/2 teaspoons dry yeast@3/4 teaspoon kosher salt@1 large egg@@For the filling:@@1/4 cup (60ml) whole milk@1/4 cup (57g) unsalted butter@1 1/2 cups (6 ounces) walnut@1/2 cup (107g) light brown sugar@2 teaspoons ground cinnamon@1/4 teaspoon kosher salt@2 tablespoons apricot jam@1 teaspoon vanilla extract@@For the topping:@@1 large egg@@Special Equipment@@Offset spatula@Rolling pin@Pastry brush","step":"Make the Dough@@Heat the milk and butter:\r\nIn a small saucepan over low heat warm the milk and the butter until the butter has melted. Alternatively, add milk and butter into a microwave safe bowl and microwave in 15-second bursts until the butter has melted. Try not to boil the milk. \r\n\r\nLet the mixture stand until lukewarm while preparing the rest of the ingredients.@Mix the dry ingredients:\r\nIn the bowl of a stand mixer fitted with the dough hook attachment, whisk together the flour, sugar, yeast, and salt.@Knead the dough:\r\nPour the warm milk mixture and the egg into the flour mixture and mix on low speed until the dough comes together into a rough ball, about 2 minutes. Increase the speed to medium-low and continue kneading until the dough is smooth and elastic and no longer sticks to the sides of the bowl. This should take 8 to 10 minutes but keep kneading until the dough gathers around the dough hook and the sides of the bowl are mostly clean.@Let the dough rise at room temperature:\r\nScrape the dough out onto a clean surface and shape it into a ball. Lightly grease the bowl with butter. Transfer the dough back into the bowl, seam-side down, and cover with plastic wrap or a damp tea towel. Let the dough rise at room temperature for 1 1/2 hours, or until doubled in size.@@Make the Filling@@Make the walnut filling — heat the milk and butter:\r\nWhile the dough rises, make the walnut filling.\r\n\r\nIn a small saucepan over low heat warm the milk and the butter until the butter has melted. Alternatively, add milk and butter into a microwave safe bowl and microwave in 15-second bursts until the butter has melted. \r\n\r\nLet the mixture stand until lukewarm while preparing the rest of the filling ingredients.@Process the filling ingredients: \r\nPlace the walnuts, brown sugar, cinnamon, and salt in the bowl of a food processor. Process until the walnuts are finely chopped and the mixture resembles coarse sand.\r\n\r\nPour in the milk and butter, jam, and vanilla extract. Process until combined. The filling will have a texture similar to natural chunky peanut butter. Cover and let sit until ready to use.@@Shape the Povitica@@Prepare the pan:\r\nGrease a 9 x 5-inch loaf pan generously with butter. Line the pan with a piece of parchment paper, leaving a couple of inches of overhang on the long sides. Don’t worry about the short sides, the parchment overhang works like handles to help you easily lift out the loaf later.@Roll out the dough:\r\nLightly flour a clean work surface and scrape the dough out onto it. Lightly dust the top of the dough with flour. Use a rolling pin to roll out the dough to a long rectangle, about 20 x 12 inches and 1/4-inch thick, with the long edge nearest you.\r\n\r\nWhile rolling, pause to move the dough regularly, lifting it off the work surface and adding a little extra flour if it starts to stick. You can also use your hands to gently stretch the dough to maintain a rectangular shape.@Spread the filling:\r\nPour the walnut filling onto the dough and use an offset spatula or the back of a spoon to spread it evenly over the entire surface of the dough, leaving a 1/2-inch margin around the edges.@Roll up the dough:\r\nWrap the dough into a snug spiral, starting with the long end closest to you. Use even pressure to form a tight cylinder. Gently stretch the dough if needed to achieve even thickness. It should be about 24 inches long.@Shape the povitica:\r\nFold the dough rope into thirds, forming a long “S” about the length of the long edge of the pan. Place the loaf in the center of the prepared pan. It’s okay if the dough doesn’t completely fill the pan at this stage. As the dough rises it will expand to fill in the loaf pan.@Proof at room temperature:\r\nCover the pan with a piece of plastic wrap or a damp tea towel. Let the dough rise at room temperature until almost doubled in size, about 1 1/2 hours. The dough should be puffy and will have risen to roughly 1/2-inch below the rim of the pan.@@Bake the Povitica@@Preheat the oven:\r\nWhen the loaf is almost ready to bake, arrange a rack in the middle of the oven and preheat to 350°F.@Egg wash the top of the dough:\r\nCrack an egg into a small bowl and beat with a tablespoon of water using a fork or a small whisk. Use a pastry brush to apply the egg wash over the top of the dough.@Bake:\r\nPlace the povitica in the oven. Lower the oven temperature to 300°F and bake the loaf for 60 to 70 minutes, or until golden brown on top. A toothpick inserted into the loaf should come out without any doughy bits sticking to it. Or you can check with an instant thermometer, which should read 190°F.@Store:\r\nStore the cooled povitica wrapped in plastic or in an airtight container on the counter for up to 3 days.\r\n\r\nYou can freeze povitica for up to 1 month. Once cooled, wrap the loaf in a couple of layers of plastic wrap, then in foil. Defrost the loaf at room temperature, still wrapped. Before serving, you can reheat it in a 325°F oven for about 10 minutes, until warmed through and the kitchen smells buttery and nutty.","rank":"","__v":0},{"_id":"64497a7d5b688aadf1043d7c","recipe":"Lemon Pound Cake","serving":"8","time":"125","calorie":"733","protein":"10","carb":"107","fat":"31","image":"https://www.simplyrecipes.com/thmb/M_i4fD2qBmYbY0n-DjL-C4oi2eM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2019__04__Lemon-Pound-Cake-LEAD-HORIZONTAL-1eb1d1d7aa3e4e45a345fe4635ba45c5.jpg","website":"https://www.simplyrecipes.com/recipes/lemon_pound_cake/","ingredient":"For the cake:@@2 1/2 cups (350g) bread flour@1/4 teaspoon baking soda@1/8 teaspoon kosher salt@1 3/4 cups granulated sugar@1 cup (16 tablespoons) butter, room temperature@Zest from 3 lemons@1/3 cup sour cream@4 large eggs@1 egg yolk@1/4 cup lemon juice, from about 1 lemon@@For the lemon syrup:@@1/2 cup granulated sugar@1/4 cup lemon juice, about 1 lemon@2 tablespoons water@@For the icing:@@1 tablespoon butter@1 1/4 cups powdered sugar@2 tablespoons lemon juice@@Special Equipment@@Stand mixer","step":"Preheat oven to 325°F@Prep the pan:\r\nButter the bottom of a loaf pan. Cut a piece of parchment paper so it covers the bottom of the pan and goes up the long sides of the pan like a sling. The short sides shouldn’t be covered. Leave enough parchment hanging over each side so that you can easily lift the loaf out of the pan.@Whisk dry ingredients:\r\nWhisk together the flour, salt, and baking soda. Set aside.@Begin making the batter:\r\nIn the bowl of a stand mixer fitted with a paddle attachment, beat together the sugar, butter, and lemon zest on medium to medium high for 8 minutes. Stop occasionally to scrape down the bowl.\r\n\r\nAdd the sour cream and beat for one more minute, scraping down the sides of the bowl halfway through. One at a time, add the eggs and egg yolk, scraping down the bowl between additions.\r\n\r\nAdd the lemon juice and beat for 1 more minute scrape down the sides of the bowl halfway through, and once more before adding the flour.@Add the flour to the batter:\r\nSet the stand mixer to stir (or the lowest setting) and add the flour mixture. Stir for about 1 minute or until the flour is just incorporated. Shut off the mixer and remove the bowl.\r\n\r\nUse a spatula to scrape the sides and bottom of the bowl, and finish folding the ingredients together. The batter will be thick and velvety.@Bake the pound cake:\r\nScrape the batter into the prepared loaf pan. Smooth the top with a spatula.\r\n\r\nBake for 1 hour and 35 minutes, or until a skewer inserted into the center of the cake comes out clean.@While the lemon cake bakes, make the lemon soaking syrup:\r\nIn a small saucepan set over medium high heat, combine sugar, lemon juice, and water. Stir occasionally and bring to a low boil.\r\n\r\nThe syrup is ready when it looks transparent and is no longer cloudy. This should take about 5 minutes. Let the syrup cool.@Soak the cake with syrup:\r\nOnce the cake has finished baking, remove it from the oven. It will have a slight crack down the center. That’s ok. Let the cake cool in the pan for 10 minutes.\r\n\r\nWith the cake still in the pan, pour half of the lemon syrup over the entire cake. Let it soak in. Then pour the remaining syrup over the cake. Let it continue cooling in the pan for another 15 minutes.\r\n\r\nRun a knife along the ends to help release the cake. Use the parchment sling to lift the cake out of the pan, and set it on a baking rack to let it cool completely.@While the cake cools, make the icing:\r\nIn a medium microwave-safe bowl, melt the butter in the microwave for 10 to 20 seconds. Make sure you cover it so you don’t end up with splattered butter everywhere.\r\n\r\nAdd the powdered sugar. Whisk together while adding the lemon juice one tablespoon at a time.@Frost the cake:\r\nOnce the cake is completely cool, pour the icing over the lemon pound cake. Gently spread the icing so it completely covers the top. It should be white and thick. Slice and serve.","rank":"","__v":0},{"_id":"64497ad75b688aadf1043d80","recipe":"Blueberry Cake","serving":"6","time":"60","calorie":"376","protein":"5","carb":"52","fat":"17","image":"https://www.simplyrecipes.com/thmb/mczgKGVvw2QnWQ4MI8RWr1oD9Wg=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2005__07__blueberry-cake-horiz-a-1200-a20ba59af6a0467fa72d2b5190bf5540.jpg","website":"https://www.simplyrecipes.com/recipes/blueberry_cake/","ingredient":"@@1/2 cup (113g, 1 stick) unsalted butter, softened, plus more for buttering the pan@1 cup (130g) all-purpose flour plus 1 teaspoon flour, divided@1 teaspoon baking powder@1/2 teaspoon salt (omit if using salted butter)@1/8 teaspoon cinnamon@3/4 cup (160g) sugar@1/4 teaspoon vanilla extract@2 large eggs@1 teaspoon lemon zest, optional@2 cups (325g) blueberries, rinsed, drained, and patted very dry (if using frozen blueberries, thaw and drain first)@1 teaspoon lemon juice@Powdered sugar for dusting@@Special Equipment@@8 or 9-inch round springform or cake pan","step":"Preheat the oven and prep the pan:\r\nPreheat the oven to 350°F and position a rack in the center.\r\n\r\nLightly butter an 8 or 9-inch springform pan and dust with flour.@Mix the flour with baking powder and salt:\r\nIn a medium bowl, vigorously whisk together 1 cup of the flour with the baking powder, salt, and cinnamon. Set aside.@Make the batter:\r\nUsing an electric mixer, beat the butter on medium high speed for 2 minutes. Add the sugar and beat until light and fluffy, a 1-2 minutes more. Beat in the vanilla extract.\r\n\r\nAdd the eggs one at a time and beat until well blended and scraping down the sides of the bowl as needed. Beat in the lemon zest, if using.\r\n\r\nReduce the speed of the mixer to low and slowly add the flour mixture, beating until smooth. The batter will be thick.@Put the batter in the pan:\r\nPut the batter in the prepared pan, smoothing the top with a spatula.@Scatter the berries over the batter:\r\nCombine the berries with the remaining teaspoon of flour and the lemon juice in a bowl. Spoon the berry mixture over the batter.@Bake:\r\nBake for 45 to 55 minutes at 350°F, or until a tester inserted into the center comes out clean. Remove from the oven and let the cake cool in the pan for 10 minutes.\r\n\r\nCarefully slide a thin knife around the edges of the cake to release it from the pan.@Dust with powdered sugar to serve:\r\nTransfer the cake to a platter, berry side up. Dust the cake with powdered sugar to serve.","rank":"","__v":0},{"_id":"64497aef5b688aadf1043d84","recipe":"Zucchini Carrot Bread","serving":"16","time":"80","calorie":"228","protein":"3","carb":"34","fat":"9","image":"https://www.simplyrecipes.com/thmb/oLS6dGOUsIni5wTlarZAkVj3hxY=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Zucchini-Carrot-Bread-LEAD-08-a27fd9b12c194e70845c92656d9e6d3d.jpg","website":"https://www.simplyrecipes.com/zucchini-carrot-bread-recipe-5323096","ingredient":"For the bread@@Butter or cooking spray, for greasing the pan@2 small carrots (8 ounces total)@2 small zucchini (10 ounces total) @2 cups (260g) all-purpose flour@1 1/2 teaspoons kosher salt@1 teaspoon baking soda@1 teaspoon baking powder@1 teaspoon ground cinnamon@1/2 teaspoon ground ginger@1/2 teaspoon ground cardamom@1 teaspoon freshly grated orange zest@1/2 cup (100g) granulated sugar@1/2 cup (100g) packed light brown sugar@1/2 cup vegetable oil@2 large eggs@1 teaspoon freshly grated orange zest@1 tablespoon demerara sugar@@For the glaze@@3/4 cup powdered sugar@4 to 5 teaspoons milk (whole or buttermilk)@1/2 teaspoon pure vanilla extract@Large pinch freshly grated nutmeg@Pinch salt@@For topping@@1/2 cup sweetened coconut flakes, toasted","step":"Preheat the oven to 350°F. \r\nGrease a 9x5-inch loaf pan with butter or cooking spray and set aside.@Grate the carrots and zucchini: \r\nUsing a box grater, carefully grate the carrots with the large holes. You should have about 1 cup packed. Set aside. \r\n\r\nNext, grate the zucchini using a box grater with the large holes. Using your hands or a clean dish towel or nut milk bag, wring out the zucchini. You should have about 1 cup packed zucchini. Set aside.@Whisk the dry ingredients for batter: \r\nIn a medium bowl, whisk the flour, salt, baking soda, baking powder, cinnamon, ginger, and cardamom together.@Combine wet ingredients for batter:\r\nIn a large bowl, whisk both sugars and vegetable oil, until combined. Add the eggs and whisk until smooth.@Finish batter:\r\nAdd the grated carrots, grated zucchini, and the orange zest to bowl and stir to distribute. Use a rubber spatula to fold in the flour mixture until just combined. There should be no visible streaks of flour once thoroughly combined.@Pour batter into prepared pan:\r\nPour the batter into the prepared pan and smooth out the top with the spatula. Sprinkle the demerara sugar over top.@Bake the bread, then cool:\r\nBake the bread for 55 to 60 minutes until a cake tester or skewer inserted into the center comes out clean. Let cool in the pan for at least 20 minutes, then transfer to a wire rack to cool completely.@Make the glaze:\r\nIn a small bowl, whisk together the powdered sugar and milk, 1 tablespoon at a time, until the mixture is a smooth and pourable consistency. Stir in the vanilla, salt, and nutmeg.@Drizzle with glaze and coconut:\r\nUse a spoon to drizzle the glaze over the cooled bread. Sprinkle the toasted coconut overtop. Cut slices serve.\r\n\r\nThis bread keeps well on the counter for a few days—just store it in an airtight container or wrapped tightly in plastic wrap. Keep in mind that the coconut topping will get less crunchy over time.","rank":"","__v":0},{"_id":"64497b265b688aadf1043d88","recipe":"Apple Bread Pudding","serving":"8","time":"65","calorie":"384","protein":"6","carb":"56","fat":"16","image":"https://www.simplyrecipes.com/thmb/J8muP_Tfg3rQBpjXN4hYM3leaIw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Apple-Bread-LEAD-4-5533d75bb8b34d599a424795e67c13a6.jpg","website":"https://www.simplyrecipes.com/apple-bread-recipe-5204006","ingredient":"For the streusel@@1/4 cup (50g) brown sugar@1/4 cup (50g) granulated sugar@1/4 cup (30g) all-purpose flour@1/2 teaspoon cinnamon@1/4 teaspoon salt@2 tablespoons butter, melted@@For the apple bread@@1 1/2 cups (180g) all-purpose flour@1/2 teaspoon baking powder@1/4 teaspoon baking soda@1/2 teaspoon salt@1 teaspoon cinnamon@1/2 cup unsalted butter, at room temperature@3/4 cup (150g) granulated sugar@1 large egg, at room temperature@1 teaspoon vanilla extract@1/2 cup plain, unsweetened Greek yogurt@1/3 cup whole milk@1 large Granny Smith, Honeycrisp, or Golden Delicious apple, peeled and diced@@Special equipment:@@9x5-inch loaf pan","step":"Preheat the oven and prepare loaf pan:\r\nPreheat the oven to 350°F. Grease a 9x5-inch loaf pan and line it with a single sling of parchment paper. Leave a 1-inch overhang of parchment paper on the long sides of the pan for easy removal after baking. @Make the streusel topping:\r\nIn a medium bowl, combine the brown sugar, granulated sugar, flour, cinnamon, and salt. Slowly drizzle the melted butter over the dry ingredients, tossing the mixture with a fork as you pour. Once all the butter is added, mix until you have a crumbly, doughy mixture. Set aside.@Mix the dry ingredients: \r\nIn a medium bowl, combine the flour, baking powder, baking soda, salt, and cinnamon. Set aside.@Combine the wet ingredients:\r\nUsing a hand mixer or a stand mixer with a beater attachment, beat the butter and sugar on medium speed for about 2 minutes, until light and fluffy. Add the egg and vanilla extract and continue to mix on medium speed until fully combined. Add the yogurt and milk and mix on medium speed until all ingredients are evenly combined with a smooth, creamy texture.@Combine the wet and dry ingredients:\r\nAdd the dry ingredients to the wet ingredients. Beat all the ingredients together starting on low speed and increasing to medium speed for 1-2 minutes, until a smooth batter forms with no lumps.@Fold apples into batter:\r\nAdd the diced apples to the batter. Using a rubber spatula, fold the apples into the batter.@Pour batter into loaf pan:\r\nPour the batter into the prepared loaf pan. Sprinkle the streusel over the top.@Bake:\r\nPlace in the oven and bake for 45-50 minutes, until the streusel is golden-brown and a toothpick inserted in the center of the loaf comes out clean.@Cool:\r\nLet the apple bread cool in the pan for 10-15 minutes, then use the parchment overhang to lift it out of the pan and place on a wire rack. Let the loaf cool on the rack for an additional 5-10 minutes before slicing and serving.","rank":"","__v":0},{"_id":"64497b3e5b688aadf1043d8c","recipe":"Brownie Banana Bread","serving":"11","time":"375","calorie":"411","protein":"6","carb":"61","fat":"17","image":"https://www.simplyrecipes.com/thmb/BCtvlYTTKGuSMzzSXeFBpF4eKio=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes_Brownie-Banana-Bread-LEAD-04-c2823ddc639440779e1268c84044f674.jpg","website":"https://www.simplyrecipes.com/brownie-banana-bread-recipe-6890812","ingredient":"For the brownies:@@10 tablespoons (140g) unsalted butter @3/4 cup plus 2 tablespoons (85g) natural unsweetened cocoa powder@1 1/4 cups (250g) sugar@1/4 teaspoon salt@2 eggs, straight from the refrigerator@1 teaspoon vanilla extract@1/2 cup (65g) all-purpose flour@@For the brownie banana bread:@@1/3 cup (76g) unsalted butter@3 medium very ripe bananas, peeled (1 1/4 to 1 1/2 cups mashed)@2/3 cup (137g) sugar @1 large egg@1 teaspoon vanilla extract@1/4 teaspoon salt@1 1/2 cups (205g) all-purpose flour@1/2 teaspoon baking soda (not baking powder)@@Special Equipment@@1 (8 x 8-inch) square pan@1 (8 1/2 x 4 1/2-inch) or (9 x 5-inch) loaf pan","step":"Bake the brownies:@@Preheat the oven to 325°F. \r\nLine the bottom of an 8 x 8-inch square pan with parchment or foil, leaving a few inches of excess hanging on either side to create flaps. Grease the pan; if using foil, grease the foil, too.@Melt the butter:\r\nIn a medium high-sided skillet or large saucepan, melt the butter over medium-low heat. Swirl the pan from time to time so the butter melts evenly.@Make the batter:\r\nRemove the pan from heat. Add the cocoa powder and whisk until smooth. Whisk in the sugar and salt; the mixture will be a lumpy, stiff mess, but that’s fine.\r\n\r\nWhisk in the eggs, one at a time. Put some muscle into it. The mixture should now be very smooth. Whisk in the vanilla.\r\n\r\nAdd the flour all at once. Switch to a spatula and vigorously beat in the flour, beating for 50 strokes to create a smooth batter. Scrape the batter into the prepared pan and smooth the top.@Bake: \r\nBake until a toothpick inserted in the center of the pan comes out with no wet streaks, about 25 minutes\r\n\r\nCool completely on a wire rack, then cover with foil and refrigerate for at least 4 hours.@Cut the brownie chunks:\r\nUse the parchment or foil handles to lift the cold, uncut brownie out of the pan and onto a cutting board. Cut in half; set the other half aside.\r\n\r\nCut the chilled half-brownie into 1/2-inch chunks. This is what goes into the banana bread. You should have about 290 grams, or 2 to 2 1/2 cups of chunks.\r\n\r\nThe remaining brownies you can just eat or save for later.@@Bake the banana bread:@@Preheat the oven to 350°F. \r\nGrease an 8 1/2 x 4 1/2 or 9 x 5-inch loaf pan.@Melt the butter:\r\nIn a small saucepan or skillet, melt the butter over low heat. Set aside.@Make the banana bread batter:\r\nIn a large bowl, mash the bananas as best you can using a whisk. Add the sugar and whisk vigorously; the sugar should help the bananas break down.\r\n\r\nWhisk in the egg, vanilla, and salt, then the melted butter\r\n\r\nSwitch to a spatula and fold in the flour and baking soda just until combined. If the batter is  thick like cement, add a few tablespoons of water to thin it out. Fold in the brownie chunks just enough to distribute them throughout the batter. Scrape the batter into the prepared pan.@Bake:\r\nBake the loaf until the center of the top springs back when you gently press it with your fingertip, about 1 hour. Set the pan on a cooling rack and let the bread cool in the pan for 10 minutes. Turn the bread out of the pan and cool completely.\r\n\r\nFor the neatest slices, I like to refrigerate the entire loaf before slicing. I also like this bread straight out of the fridge, but you get more of the flavors when you serve it at room temperature.@Store:\r\nWell wrapped, the bread will keep on the countertop for about 3 days. It also freezes beautifully. ","rank":"","__v":0},{"_id":"64497b5c5b688aadf1043d92","recipe":"Italian Meatballs","serving":"8","time":"85","calorie":"577","protein":"38","carb":"25","fat":"36","image":"https://www.simplyrecipes.com/thmb/hNsa7EKdbb4HGYP_Q6FdEDCI2pw=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2011__11__italian-meatballs-horiz-c-1800-e83b24e913364fd6b867805335961d65.jpg","website":"https://www.simplyrecipes.com/recipes/italian_meatballs/","ingredient":"For the optional tomato sauce@@2 tablespoons extra virgin olive oil@3/4 cup finely chopped onion@3/4 cup finely chopped carrots@3/4 cup finely chopped celery@2 tablespoons chopped fresh parsley@1 clove garlic, minced@1 (28-ounce) can crushed or whole tomatoes, including the juice, or 1 3/4 pound of fresh tomatoes peeled, seeded, and chopped@1/2 teaspoon dried basil or 2 tablespoons chopped fresh basil@1 teaspoon tomato paste@Salt and freshly ground black pepper, to taste@@For the meatballs@@2/3 cup milk (whole or 2 percent)@3 slices of white bread, crusts removed (about 3 ounces)@1 pound ground beef (at least 16 percent fat)@1 pound ground pork@1/4 cup ricotta cheese@1/4 cup grated Parmesan or Romano cheese@2 large eggs@1 teaspoon salt (or 2 teaspoons kosher salt)@1 tablespoon chopped fresh parsley@2 teaspoons freshly ground black pepper@1 teaspoon dried oregano or marjoram@2 to 3 cloves garlic, minced@About 1 cup flour, for dusting@1/3 cup extra virgin olive oil@2 1/2 cups (24 ounces) tomato sauce (recipe follows, or use already prepared)","step":"Make the tomato sauce:@@Heat the olive oil in a large skillet on medium heat. Add the onion, carrots, celery, and parsley. Stir to coat with the oil, reduce the heat to low, and cover the pan. Cook until the vegetables are soft and cooked through, 15 to 20 minutes.@Remove the cover, add the garlic, and increase the heat to medium-high. Cook the garlic for half a minute, then add the tomatoes (if using whole canned tomatoes, break up with your fingers as you add them to the pan). Add the basil and tomato paste. Season with salt and pepper.@Bring to a low simmer, reduce the heat to low, and let cook uncovered until thickened while you prepare the meatballs, 15 to 30 minutes.@Purée in a blender, or push through a food mill if you'd like a smooth consistency. Return to the pan and adjust the seasonings.@@Make the meatball@@Soak the torn bread in hot milk:\r\nTo make the meatballs, heat the milk in a small pot until steamy. Turn off the heat, tear the bread into little pieces and soak it in the milk until it partially dissolves. Mash it until you get something that resembles a paste. Turn it out onto a plate to let it cool.@Make the meatball mixture:\r\nIn a large bowl, combine the beef, pork, ricotta cheese, grated Parmesan, eggs, garlic, parsley, oregano, salt, pepper, and the bread-milk mixture. Mix it well with your hands until it barely combines.\r\n\r\nDon't overwork the mixture or it will become tough. It is OK to have some discernible bits of bread or meat in the mix; better that than overworked meatballs.@Form the meatballs:\r\nWet your hands and form the meatballs. A traditional size for this sort of meatball is 2 to 3 inches across, but you can make them any size you want.\r\n\r\nOnce you roll the meatball in your hands, roll it in the flour to give it a good coating. Set each one on a baking sheet as you work. You might need to rinse your hands a few times as you make the meatballs.@Brown the meatballs:\r\nWhen all the meatballs are formed, heat the olive oil in a large skillet over medium-high heat. Brown the meatballs on at least 2 sides. Don't worry about the center getting cooked through, as you will finish these in the sauce.@Finish cooking the meatballs in tomato sauce:\r\nOnce all the meatballs are browned, arrange them in the sauce, turning each one over in the sauce to coat.\r\n\r\nCover the pot and simmer gently for 15 to 20 minutes. Serve with the sauce and pasta or crusty bread. Sprinkle with a little chopped parsley for garnish if you want.","rank":"7","__v":0},{"_id":"64497b7c5b688aadf1043d98","recipe":"Vegan Meatballs","serving":"4","time":"31","calorie":"273","protein":"26","carb":"7","fat":"16","image":"https://www.simplyrecipes.com/thmb/Mx34G761XPc4iMaHf7X-xwgfWEk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Vegan-MeatballsLEAD-12-55c5f73e734d47ea8233e6370031b517.jpg","website":"https://www.simplyrecipes.com/vegan-meatballs-recipe-7110027","ingredient":"1 tablespoon ground flax meal@2 tablespoons water@2 cloves garlic, finely minced or grated@1/4 cup finely diced white onion@2 tablespoons finely chopped fresh parsley, or 2 teaspoons dried parsley@2 tablespoons breadcrumbs, plain or Italian@2 tablespoons nutritional yeast@1 tablespoon freshly grated vegan Parmesan@1 teaspoon dried oregano@1/2 teaspoon fennel seeds, optional@1/2 teaspoon onion powder@1/2 teaspoon freshly ground black pepper@1/4 teaspoon salt@1/4 teaspoon chili flakes@1 (12-ounce) package Impossible Foods ground beef","step":"Make the flax egg:\r\nWhisk together the ground flax meal and water in a small bowl. Set aside for 10 minutes.@Make the meatball mixture:\r\nMeanwhile, add the garlic, onion, parsley, breadcrumbs, nutritional yeast, vegan Parmesan, oregano, fennel seeds (if using), onion powder, black pepper, salt, and chili flakes to a medium-sized mixing bowl. Whisk to combine. \r\n\r\nAdd the flax egg and Impossible meat. Use clean hands to mix just until combined.@Form the meatballs:\r\nLine a baking sheet with parchment paper. Set aside a small bowl or glass of water. \r\n\r\nUsing a cookie scoop or rounded tablespoon to measure, gently roll 1-inch balls and place them on the baking sheet. Dip your fingers in the water to make it easier to form your meatballs. You should have 12 to 16 meatballs.@Refrigerate and preheat the oven:\r\nRefrigerate the meatballs for 30 minutes. This helps them keep their shape and provides a juicier, more tender texture.\r\n\r\nPreheat the oven to 425°F.@Bake:\r\nBake the meatballs until browned, 10 to 14 minutes. To check for doneness, cut one in half. It should be largely cooked through, although a very small amount of pinkness at the center is okay. Enjoy immediately. Store leftover meatballs in the refrigerator for up to 4 days or in the freezer for 2 months. To reheat, drop them into simmering sauce or broth and cook until warmed through.","rank":"","__v":0},{"_id":"64497ba65b688aadf1043d9c","recipe":"Lemon Ricotta Pancakes","serving":"5","time":"30","calorie":"289","protein":"12","carb":"35","fat":"11","image":"https://www.simplyrecipes.com/thmb/lkIUPZwl9nc3hFYDHLgDsV_KSmM=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2018__03__Lemon-Ricotta-Pancakes-LEAD-1-HORIZONTAL-d6d1556dda9f44d49cdddb0540d91e21.jpg","website":"https://www.simplyrecipes.com/recipes/lemon_ricotta_pancakes/","ingredient":"4 large eggs@1/3 cup plus 1 tablespoon sugar, divided@1 cup all-purpose flour@1 teaspoon baking powder@1/2 teaspoon salt, plus 1 pinch for beating the egg whites@1 cup whole milk ricotta@3 tablespoons lemon juice@2 teaspoons lemon zest, finely grated@1/2 cup whole or 2% milk@Butter or vegetable oil, for the griddle@Fresh berries, for serving@Maple syrup, for serving","step":"Separate the eggs:\r\nCarefully separate the eggs, placing the yolks and the eggs in separate bowls.@Beat the egg whites:\r\nIn a squeaky clean mixer bowl, beat the egg whites with a pinch of salt at high speed until very frothy. With the mixer still on high, slowly add 1 tablespoon of sugar. Continue beating until stiff peaks form, about 5 minutes. Set aside.@Mix the dry ingredients:\r\nIn a bowl, whisk the flour, baking powder and 1/2 teaspoon of the salt until blended. Set aside.@Make the ricotta mixture:\r\nIn a large bowl, whisk the egg yolks and the remaining 1/3 cup of sugar together. Add the ricotta, lemon zest, and lemon juice and whisk until smooth. Stir in the milk until blended.@Make the batter:\r\nAdd the flour mixture to the egg yolk mixture and stir with a spatula just until combined. Fold in one-third of the beaten egg whites to lighten the batter. Add the remaining egg whites and gently fold until only a few streaks of white remain.@Cook the pancakes:\r\nSet a griddle, cast iron pan, or non-stick skillet over medium-low heat and brush with oil. When the pan is hot enough that a flick of water sizzles on contact, use a 1/2-cup measure to scoop the batter and drop onto the pan. With the back of a spoon, spread the batter of each pancake into a 4- to 5-inch round.\r\n\r\nKeep the temperature of the pan at medium to medium-low. Cook each pancake for 2 to 3 minutes, or until bubbles form on top. Flip and cook for 1 to 2 minutes longer, until the pancakes are cooked through.\r\n\r\nServe each batch immediately or transfer the pancakes to a sheet pan in a warm oven to keep warm until ready to serve.@Serve:\r\nServe warm with butter, maple syrup and fresh berries.","rank":"","__v":0},{"_id":"64497bc35b688aadf1043da0","recipe":"Microwave Sweet Potato","serving":"1","time":"10","calorie":"255","protein":"6","carb":"59","fat":"0","image":"https://www.simplyrecipes.com/thmb/vBbpcy85n2Pyhq4SAABOGnpVwS0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Microwave-Sweet-Potato-LEAD-2-601e1ed0c2834feb84c8544c9e5bc1e6.jpg","website":"https://www.simplyrecipes.com/microwave-sweet-potato-recipe-7095968","ingredient":"1 medium sweet potato, about 10 ounces@1/2 teaspoon olive or canola oil, optional@1/4 teaspoon kosher salt, optional","step":"Prepare the sweet potato:\r\nIf you’d like to crisp the skin on your sweet potato, preheat the oven to 425°F.\r\n\r\nGive the sweet potato a wash, but don’t dry it off. The residual moisture will help keep the sweet potato moist.\r\n\r\nUse a fork to prick the sweet potato 4 to 5 times all over.@Wrap the sweet potato:\r\nMoisten a paper towel with water and wring it out. Use it to tightly wrap the sweet potato and place it on a microwave-safe plate.\r\n\r\nAlternatively, you can add the sweet potato to a microwave-safe lidded container. Add the lid, leaving it just barely cracked.@Microwave:\r\nPlace the plate in the microwave and cook on high power for 5 minutes. When done, you’ll be able to easily pierce the sweet potato all the way to the center with a fork or all the way through with a paring knife. If your sweet potato is not quite tender enough, re-wrap it and microwave it for another minute.@Crisp the skin (optional):\r\nFor lightly crispy skin, unwrap the sweet potato, place it on a small baking sheet, and brush all over with oil. Sprinkle with salt, if desired. Bake at 425°F for 10 minutes.","rank":"","__v":0},{"_id":"64497bef5b688aadf1043da4","recipe":"Lasagna Soup","serving":"5","time":"53","calorie":"478","protein":"27","carb":"27","fat":"30","image":"https://www.simplyrecipes.com/thmb/N-d72ZMNH2CUJdhgqnQqo0dWlQs=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Lasagna-Soup-LEAD-12-f1f82c3766af4777a32147170209b993.jpg","website":"https://www.simplyrecipes.com/lasagna-soup-recipe-7198089","ingredient":"Kosher salt@8 ounces lasagna noodles, broken into bite-sized pieces@1 tablespoon extra-virgin olive oil@1 pound bulk Italian sausage or links, casings removed@1 yellow onion, chopped@3 cloves garlic, chopped@2 tablespoons tomato paste@1 teaspoon dried basil@1 teaspoon dried oregano@1/4 teaspoon crushed red pepper flakes@4 cups low-sodium chicken broth@1 (15-ounces) can crushed tomatoes@1/2 cup whole milk ricotta cheese@1/4 cup grated Parmesan cheese@Dash freshly ground black pepper@1/2 cup shredded whole milk mozzarella cheese (about 2 ounces)@6-8 fresh basil leaves, torn","step":"Cook the noodles:\r\nBring a large pot of salted water to a boil. Cook the broken lasagna noodles according to the package directions. Drain, rinse the noodles with cold water (this will stop the cooking process and prevent the pasta from sticking together), then set aside.@Brown the sausage:\r\nWhile the pasta is cooking, heat the olive oil in a large (at least 4 quart) Dutch oven or heavy-bottomed pot over medium-high heat. Add the sausage, breaking it up with a wooden spoon. Cook until the sausage is mostly browned, 5 to 7 minutes.@Add the aromatics, tomato paste, and seasonings:\r\nAdd the onion and garlic to the sausage. Cook, stirring occasionally, until the aromatics are softened, 5 to 7 minutes. Add the tomato paste, dried basil, dried oregano, and crushed red pepper and cook, stirring, until the tomato paste darkens, about 2 minutes.@Add the broth, tomatoes, and water:\r\nAdd the chicken broth, crushed tomatoes, and 1 cup of water and bring the soup to a boil, uncovered. Skim any film that may rise to the surface from the sausage. Reduce the heat and simmer, uncovered, for 15 minutes.@Mix the ricotta and Parmesan:\r\nWhile the soup simmers, combine the ricotta and Parmesan in a medium bowl. Season with 1/8 teaspoon kosher salt and a dash of black pepper.@Assemble the soup and serve:\r\nAdd about 1 cup of cooked pasta to each individual serving bowl. Taste the soup and season with salt and/or pepper if it needs it. Ladle soup into each serving bowl, over the pasta (the heat from the soup will warm the noodles to serving temperature). Top each bowl with mozzarella cheese, the ricotta mixture, and torn basil.\r\n\r\nStore the cooked noodles and soup in separate airtight containers in the refrigerator for 3 to 5 days.","rank":"","__v":0},{"_id":"64497c105b688aadf1043daa","recipe":"Classic Kimbap (Korean Seaweed Rice Roll)","serving":"5","time":"45","calorie":"285","protein":"12","carb":"33","fat":"11","image":"https://www.simplyrecipes.com/thmb/jOPGXanAy7n7ot4aLgpJ4mtTavk=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Kimbap-LEAD-11-41a43d78ed4b4ec38d732c7e3cf67832.jpg","website":"https://www.simplyrecipes.com/classic-kimbap-korean-seaweed-rice-roll-recipe-5509308","ingredient":"For the steak@@6 ounces skirt steak or sirloin beef, cut into 3 x 1/4-inch strips@2 teaspoons soy sauce@1 teaspoon rice vinegar@1 teaspoon sugar@1 clove garlic, grated@1 teaspoon vegetable oil@@For the rice@@4 cups freshly cooked medium-grain white rice@2 teaspoons sesame oil@1/2 teaspoon kosher salt@@For the spinach@@8 ounces spinach leaves, washed@2 teaspoons sesame oil@1/4 teaspoon kosher salt@@For the carrots@@1 teaspoon vegetable oil@1 large carrot, peeled and cut into 1/8-inch-wide matchsticks@Pinch kosher salt@@For the kimbap@@6 (1/4-inch wide) strips danmuji (yellow pickled radish)@6 (about 8 x 8-inch) sheets gim (roasted seaweed)@Sesame oil, for brushing the kimbap@@Special Equipment@@Bamboo or silicone sushi rolling mat","step":"Marinate the beef:\r\nIn a medium bowl, add the steak, soy sauce, rice vinegar, sugar, and garlic. Mix well and cover with plastic wrap. Set aside to marinate while you prepare the other ingredients.@Season the rice:\r\nIn a large bowl, add the freshly cooked rice, sesame oil, and salt. Mix with a large spoon until the rice is evenly coated in the sesame oil. Set aside to cool.@Cook the spinach:\r\nBring a medium pot of water to a boil over high heat. Fill a large bowl with ice water and set it next to the stovetop. Blanch the spinach in the boiling water for about 15 seconds. Use tongs to transfer the spinach into the ice water to stop the cooking. Once cooled, use your hands to squeeze out as much water as possible. Transfer it into a medium bowl and stir in the sesame oil and salt. Place the seasoned spinach on a large plate.@Cook the carrots:\r\nHeat a large pan with 1 teaspoon vegetable oil over medium-high heat. Sauté the carrots for about 1 minute until a little tender. It will not be soft and cooked through. Stir in a pinch of salt. Place the cooked carrots next to the spinach.@Cook the beef:\r\nSet the same pan used to cook the carrots over medium-high heat and add 1 teaspoon vegetable oil. Sauté the marinated beef until cooked through, about 4 minutes. Place the cooked beef next to the spinach and carrots.@Assemble the kimbap:\r\nYou can set the strips of danmuji on the same large plate with the fillings. Fill a small bowl of water for dipping your fingers into. Having all the ingredients ready and together will help make assembling the kimbap much easier. \r\n\r\nPlace a sheet of gim, shiny side-down, on the rolling mat. Use your fingers to spread about 3/4 cup of rice evenly on top of the seaweed, leaving about an inch border uncovered at the top. Lightly dampen your fingers with water to prevent the rice from sticking to them. Dip a finger into the water and lightly dampen the inch border of seaweed. This will help seal it after you roll it. @Add the fillings: \r\nPlace about one sixth of the prepared carrots, spinach, beef, and danmuji on the center of the rice—they will lay in a strip from left to right.@Roll the kimbap:\r\nLift the end of the rolling mat closest to you to fold the gim over the filling, squeezing gently and evenly. Tuck the filling in with your fingers and continue rolling and squeezing until you reach the end of the roll. Pull the end of the mat out and above the roll. Press into the dampened border to seal it, seam-side down. \r\n\r\nBrush the outside of the roll with a little sesame oil.@Roll the remaining kimbap. The gim will become more pliable as it sits, making it easier to cut. Use a sharp knife to cut the kimbap into 6 to 8 pieces. Serve at room temperature.","rank":"","__v":0},{"_id":"64497c285b688aadf1043dae","recipe":"Pepperoni Rolls","serving":"12","time":"220","calorie":"336","protein":"9","carb":"33","fat":"18","image":"https://www.simplyrecipes.com/thmb/y6xF7tRxZHIJXepRj8eW_1lZm6M=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Pepperoni-Rolls-LEAD-3-bf96b86c91d646a49b0367e2fcf7a0e2.jpg","website":"https://www.simplyrecipes.com/pepperoni-rolls-from-scratch-recipe-5324979","ingredient":"1/4 cup warm water@1 (.25-ounce) package (2 1/4 teaspoons) active dry yeast@3 1/2 cups (451g) all-purpose flour, divided, plus more if needed@1 teaspoon salt@8 tablespoons (113g) unsalted butter, divided@2 tablespoons honey@3/4 cup buttermilk@1 large egg@8 to 9 ounces (about 144 slices) thinly sliced pepperoni","step":"Proof the yeast and measure the flour:\r\nIn a small bowl, place 1/4 cup warm water and sprinkle the yeast over it. Let it sit until dissolved and creamy, about 5 minutes.\r\n\r\nMeanwhile, in a large mixing bowl, combine 3 cups (387g) flour and salt.@Melt the butter, then add the milk, honey, and egg:\r\nIn a small saucepan, melt 4 tablespoons butter over medium-low heat. Whisk in the honey and buttermilk, and heat just until warm to the touch (do not boil). Remove from heat and whisk in the egg.@Make the dough:\r\nAdd the water and yeast mixture to the flour, along with the buttermilk mixture. Mix with a wooden spoon until the dough just comes together. At first it will be quite sticky. If needed, add the remaining 1/2 cup (64g) flour, bit by bit. Resist the temptation to add a lot of flour; you want a soft dough that’s still kneadable.\r\n\r\nTransfer to a clean counter and gently knead by hand until smooth and supple, about 5 minutes. I don’t need to flour my counter—if the dough sticks, it needs more flour. Place the dough in a large, greased bowl, cover, and let rise on your counter until doubled in bulk, 1 to 2 hours.@Preheat the oven to 350°F:\r\nPosition racks in the upper and lower thirds and line two baking sheets with parchment.@Divide the dough and prep for baking:\r\nDivide the dough into 12 equal pieces and let them rest on a lightly floured surface for 10 minutes.\r\n\r\nMelt the remaining 4 tablespoons of butter. Divide the pepperoni into 12 roughly equal piles.@Form the rolls, then let them rise:\r\nTake a piece of dough and pat it into a square roughly 4 to 5 inches across. Imperfection is totally acceptable here, and in fact slightly preferable. Shingle the pepperoni slices over the square, leaving a 1/4-inch border around the dough. Roll up the dough and firmly pinch the bottom seam to seal. Place it seam-side-down on the baking sheet. Repeat with the remaining dough. You’ll wind up with 6 rolls per sheet.\r\n\r\nBrush the rolls with half of the melted butter. Cover each baking sheet with a clean dish towel and let rise for 30 minutes. The rolls will not puff up visibly.@Bake the rolls and serve:\r\nBake until lightly browned, 30 to 40 minutes, rotating the sheets from top to bottom and back to front halfway through baking. Immediately after removing from the oven, brush with the remaining butter—you may need to rewarm the butter slightly before brushing. \r\n\r\nServe warm or at room temperature. Keep the cooled rolls at room temperature in a tightly sealed plastic bag or wrapped in plastic wrap for up to 3 days.\r\n\r\nTo freeze the baked rolls, cool completely. Wrap each roll in plastic wrap, then in foil, and then pop the individually wrapped rolls in a zip top storage bag. Freeze for up to 1 month. Thaw on the counter and, for the best eating experience, warm in a microwave for 15 to 30 seconds before eating.","rank":"","__v":0},{"_id":"64497c445b688aadf1043db2","recipe":"Sesame Soba Noodles","serving":"4","time":"14","calorie":"244","protein":"5","carb":"23","fat":"16","image":"https://www.simplyrecipes.com/thmb/VKiiyac-r40L1f5lkc_wMJkCr2Q=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Sesame-Soba-Noodles-LEAD-08-567d5502f67e442f832c82e2e066e072.jpg","website":"https://www.simplyrecipes.com/sesame-soba-noodles-recipe-5324410","ingredient":"For the noodles@@9 ounces dry soba noodles @1/4 cup toasted sesame oil@3 tablespoons soy sauce@2 tablespoons maple syrup or sugar@2 tablespoons fresh lemon juice or rice vinegar@2 tablespoons toasted sesame seeds (black or white)@2 green onions, roots trimmed and finely chopped@1 clove garlic, grated with a Microplane@1/4 teaspoon freshly ground black pepper@@Optional toppings@@Thinly sliced radishes@Chopped cilantro@Any type of micro greens","step":"Cook the soba noodles: \r\nFill a large pot with about 3 quarts of water and set it over high heat. You don’t need to salt the water. Cover the pot with a lid if you’re hangry and need it to boil faster. \r\n\r\nWhen it comes up to a boil, add the soba noodles and cook for 4 minutes, stirring frequently with a large fork so that they don’t stick to each other or to the bottom of the pot. \r\n\r\nDrain the noodles into a colander set in the sink and immediately rinse it with cold running water until the noodles feel cool to the touch. Leave the colander in the sink to give the noodles a chance to drain well.@Meanwhile, make the dressing: \r\nIn a large bowl, add the sesame oil, soy sauce, maple syrup, lemon juice, sesame seeds, green onions, garlic, and black pepper. Whisk well with a fork until combined.@Dress the noodles: \r\nTap the colander in the sink forcefully a few times to get rid of as much water as possible. Tip the noodles on top of the dressing and use the fork to toss until evenly coated. Serve at room temperature or chilled after you pop it into the fridge until ready to serve. \r\n\r\nLeftovers taste even better since the noodles get a chance to soak up the dressing without getting mushy. It can be refrigerated for up to 3 days. I do not recommend freezing it. ","rank":"","__v":0},{"_id":"64497c635b688aadf1043db6","recipe":"Tamagoyaki","serving":"4","time":"20","calorie":"320","protein":"28","carb":"2.4","fat":"22","image":"https://www.simplyrecipes.com/thmb/Vjqwr3jeDL13ZgOPGW_kH1xl8-0=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Tamagoyaki-LEAD-05-609e5aa03daa4761b6b6eab979b0f531.jpg","website":"https://www.simplyrecipes.com/tamagoyaki-recipe-5272304","ingredient":"1/4 cup warm water@1/4 teaspoon instant dashi powder, like Ajinomoto Hondashi@4 large eggs@2 teaspoons sugar@1/2 teaspoon kosher salt@1 teaspoon soy sauce@1 teaspoon mirin@1 tablespoon canola oil@Grated daikon, for serving (optional)","step":"Make the dashi stock:\r\nIn a small bowl or glass measuring cup, combine the 1/4 cup warm water and dashi powder. Mix with a fork until the granules dissolve. The warm water simply helps them dissolve, so don’t stress if you use room temperature or cold water.@Beat the eggs:\r\nIn a medium bowl, add the eggs, sugar, and salt. Use a fork to beat the eggs until thoroughly combined. Try not to incorporate too many bubbles.@Season the eggs:\r\nAdd the dashi stock, soy sauce, and mirin. Mix until the ingredients are incorporated.@Strain the eggs (optional):\r\nFor a silkier custard-like texture, strain the eggs through a fine mesh strainer set over a liquid measuring cup with the spout—it will make pouring the egg batter into the pan easier.@Grease and heat the pan:\r\nPlace the oil in a small bowl and dip a small, folded paper towel into it. Use the saturated paper towel to wipe the inside of a kotobuki tamagoyaki or small nonstick pan. Heat the skillet over medium heat, enough to immediately start cooking the eggs when they are added but not so hot that they brown right away, then reduce the heat to medium-low.@Cook the first layer:\r\nPour a small amount of batter into the pan, just enough to fully coat the bottom. Cook until it is mostly set, with the top still slightly liquidy.\r\n\r\nUse chopsticks or a thin fish spatula to lift one end, flipping and rolling it over to the opposite end of the pan. Don’t worry if the first couple of flips are wrinkled or scrunched up. Just keep on rolling with it.@Add two more layers: \r\nUse the oil-saturated paper towel to wipe the skillet with more oil, lifting the cooked egg up to get some oil under it. Then pour more egg batter in, just enough to coat the bottom of the pan. Lift the cooked egg up slightly and tilt the pan so the egg batter can get under it. \r\n\r\nCook until it’s mostly set. Roll the eggs again the opposite direction, building up layers, sort of like building a snowman. Repeat this process one more time, oiling the pan, adding more egg batter, and rolling it back the other way. You will have used half the egg batter at this point.\r\n\r\nSlide the tamagoyaki onto a serving plate or a cutting board. \r\n\r\nMake a second tamagoyaki with the remaining batter following the same process.@Serve the tamagoyaki:\r\nCut the tamagoyaki into 1-inch slices to reveal the swirls inside. Serve with grated daikon radish on the side, if you’d like, or as part of a larger Japanese-inspired meal.\r\n\r\nLeftovers can be refrigerated for 3 or 4 days. Though you can serve it cold, I like to remove it from the fridge and let it sit on the counter for 30 minutes or so to take the chill off. You can also heat it up briefly in the microwave in 15-second bursts until warmed through.","rank":"8","__v":0},{"_id":"64497c7b5b688aadf1043dba","recipe":"Plantain Frittata","serving":"2","time":"30","calorie":"539","protein":"13","carb":"77","fat":"24","image":"https://www.simplyrecipes.com/thmb/Z_lRXoEEY-01tJv5aUZI790XBR8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Plantain-Frittata-LEAD-06-583a3d0b039a4b1399e5564268c257d7.jpg","website":"https://www.simplyrecipes.com/plantain-frittata-recipe-5235766","ingredient":"3 large eggs@2 tablespoons plus 1 teaspoon olive oil, divided@1/2 red, green, yellow bell pepper, finely diced@3 scallions, thinly sliced@2 Roma tomatoes, small dice@1/2 cup baby spinach@1 teaspoon sea salt, divided@1 teaspoon black pepper, divided@2 small ripe yellow plantains, peeled and sliced into 1cm rounds @1 tablespoon fresh rosemary, minced@Dried red chile flakes, to serve","step":"Preheat the oven to 400°F@Beat the eggs:\r\nCrack the eggs into a medium bowl and whisk until there are no egg whites visible and it begins to look a little frothy. Set aside.@Cook the vegetables:\r\nAdd 2 tablespoons of olive oil to a cast-iron pan over medium heat. Add the bell peppers, scallions, and tomatoes. Cook, until the peppers become brighter in color and the scallions become slightly softened, 1 to 2 minutes.\r\n\r\nAdd the spinach to the pan and cook, stirring occasionally, until it has wilted, about 1 minute. Season with 1/2 teaspoon salt and 1/2 teaspoon pepper.@Assemble the frittata: \r\nPour the whisked eggs into the pan over the vegetables. Layer the plantains over the eggs in a circular pattern until the pan is entirely filled.@Drizzle with olive oil:\r\nDrizzle the remaining olive oil (about a teaspoon), over the top of the plantains. Season with the remaining 1/2 teaspoon salt and 1/2 teaspoon pepper. Garnish with chopped fresh rosemary.@Bake the frittata:\r\nBake frittata for 15 minutes. Once its fully cooked, you will notice that the frittata will have risen, the plantains will be golden brown and slightly crispy.@Serve:\r\nCut the frittata into quarters and serve 2 quarters per person. Sprinkle a pinch of chili flakes (optional) and serve alongside your favorite salad.","rank":"","__v":0},{"_id":"64497c955b688aadf1043dbe","recipe":"Tteokbokki (Spicy Korean Rice Cakes)","serving":"3","time":"30","calorie":"440","protein":"10","carb":"79","fat":"10","image":"https://www.simplyrecipes.com/thmb/AZp2V0bULEhElM4hoJyn8soHLxI=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Simply-Recipes-Tteokbokki-LEAD-2-ff73814d0319465e8b16723c7d35bc06.jpg","website":"https://www.simplyrecipes.com/tteokbokki-spicy-korean-rice-cakes-recipe-5224356","ingredient":"2 large eggs@1 tablespoon vegetable oil@1 small yellow onion, cut into 1/2-inch halfmoons@3 green cabbage leaves, cut into 2-inch squares@2 cloves garlic, minced@1 1/2 cups water@1 pound (about 3 cups) garaetteok (cylindrical Korean rice cakes)@2 scallions, ends trimmed and cut into 2-inch pieces@3 tablespoons gochujang@1 tablespoon soy sauce, plus more to taste@2 teaspoons sugar, plus more to taste@1 teaspoon toasted sesame oil@1 teaspoon toasted sesame seeds","step":"Hard-boil the eggs:\r\nFill a medium bowl with ice water and set it aside. Fill a small saucepan with 3 inches of water, enough to fully submerge the eggs. Do not add the eggs yet. Bring it up to a boil over medium-high heat. \r\n\r\nAs soon as the water boils, carefully add the eggs. Mine are cold straight from the fridge. Cook them for 8 minutes. Using a large spoon, transfer the eggs into the prepared ice water to stop them from cooking. When the eggs feel cold to the touch, peel and cut them in half lengthwise. Set them aside. @Cook the vegetables:\r\nIn a 12-inch skillet over medium-high heat, add the oil and heat it until hot (rippling, but not smoking). Add the onions, cabbage, and garlic and cook, stirring frequently with a large spoon, for about 3 minutes. The vegetables should be translucent and a little browned. @Add the tteok and seasonings: \r\nAdd the water, tteok, scallions, gochujang, soy sauce, and sugar. Stir until the gochujang is fully dissolved into the sauce.@Simmer the tteokbokki:\r\nBring the sauce to a boil, then reduce the heat to low and simmer, stirring occasionally, about 10 minutes. Nudge the tteok to submerge them into the sauce as much as possible. The sauce will reduce and thicken, and the tteok will look glossy. \r\n\r\nWhen cooked properly, the tteok is a little chewy, tender, but not mushy. You should be able to cut it with a gentle wiggle with the side of your spoon. @Add sesame oil and season:\r\nStir in the sesame oil. Taste the sauce and adjust seasoning with more soy sauce or sugar. The sauce should be flavorful and a little sweet to balance out the spiciness. @Serve the tteokbokki: \r\nTransfer the tteokbokki to a serving platter. Sprinkle the sesame seeds all over and serve it with the hard-boiled eggs. ","rank":"","__v":0},{"_id":"64497cbb5b688aadf1043dc2","recipe":"Broccoli Cheddar Egg Bites","serving":"24","time":"55","calorie":"58","protein":"2","carb":"3","fat":"4","image":"https://www.simplyrecipes.com/thmb/47AkEOtTerIro7JYtTRw0mvfpfs=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/__opt__aboutcom__coeus__resources__content_migration__simply_recipes__uploads__2015__09__broccoli-cheddar-bites-horiz-a-1500-a2b7ad7c249c43faac916aec586590ee.jpg","website":"https://www.simplyrecipes.com/recipes/broccoli_cheddar_bites/","ingredient":"Florets from 1 large bunch broccoli (about 300g broccoli florets)@2 large eggs, lightly beaten@1/2 cup crustless, torn (into tiny pieces) fresh bread, packed@1/4 cup grated onion@1/4 cup mayonnaise@1 cup (4 ounces, 114g), packed, grated sharp cheddar cheese@1/2 teaspoon lemon zest@1/2 teaspoon kosher salt@1/4 teaspoon freshly ground black pepper","step":"Preheat the oven:\r\nPreheat oven to 350°F.@Steam and chop the broccoli:\r\nPlace 1 inch of water in a pot with a steamer basket. Bring to a boil. Add the broccoli florets. Steam the broccoli florets for 5 minutes, until just tender. Rinse with cold water to stop the cooking.\r\n\r\nFinely chop the steamed broccoli florets. You should have about 2 1/2 cups.@Make the filling:\r\nPlace the beaten eggs and the torn bread in a large bowl. Mix until the bread is completely moistened.\r\n\r\nAdd the grated onion, mayonnaise, cheese, lemon zest, salt and pepper. Stir in the minced broccoli.@Distribute the broccoli mixture:\r\nCoat the wells of 2 mini muffin pans (1 dozen wells each) with non-stick spray. We recommend using non-stick mini muffin pans.\r\n\r\nDistribute the broccoli mixture in the muffin wells.@Bake:\r\nBake at 350°F for 25 minutes until cooked through and lightly browned on top.","rank":"","__v":0},{"_id":"64497cda5b688aadf1043dc6","recipe":"Deviled Chicken Francese","serving":"4","time":"30","calorie":"1186","protein":"87","carb":"83","fat":"52","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2019/2/0/TM2803_Deviled-Chicken-Francese.jpg.rend.hgtvcom.826.620.suffix/1552666958262.jpeg","website":"https://www.foodnetwork.com/recipes/rachael-ray/deviled-chicken-francese-5639443","ingredient":"4 pieces boneless, skinless chicken breast (no tenders)@Salt and pepper @AP flour, about 1 cup @3 large eggs @1 scant tablespoon Dijon mustard @3 tablespoons milk @3 tablespoons Pecorino Romano or Parmigiano-Reggiano cheese @1/4 to 1/3 cup olive oil or vegetable oil (light in color olive oil or safflower oil)@2 lemons @3 tablespoons butter @2 large cloves garlic, 1 crushed or chopped, 1 halved @About 3/4 cup white wine @1 tablespoon Calabrian chili paste, harissa or sriracha @About 1 1/2 cups chicken stock @A handful flat-leaf parsley, for serving @1 loaf ciabatta bread, 12 to 14 inches long, halved @EVOO, for drizzling @Flaky sea salt, for sprinkling@1 large bundle arugula, cleaned, or boxed leaves ","step":"Gather your ingredients and a gel board to prepare chicken.@Halve the chicken breasts horizontally and butterfly them. Use a mallet to thin meat or even it out if needed -- it depends on the size of the chicken breasts. Season meat with salt and pepper.@Set a station up: Flour in shallow dish; eggs beaten with mustard, milk, salt, pepper and cheese; large frying pan with oil (4 to 5 turns of the pan); a baking sheet with wire rack inserted and lined with parchment paper to remove the chicken to.@Preheat the oil in skillet over medium to medium-high heat. Coat chicken 2 at a time in flour, shake of excess, then in egg and allow excess to drip off. Cook chicken 3 to 4 minutes on each side. Repeat, removing cooked chicken to wire rack. Once chicken is cooked, slice and lightly brown 1 lemon; add to pan with chicken. Wipe excess oil from pan, return to heat and add butter. When it foams add 1 clove crushed garlic, juice of 1 lemon, wine and chili paste and reduce about 3 minutes. Add stock and reduce 5 minutes more. Pick and chop the parsley.@Char the bread over gas burner or under broiler. Rub charred bread with halved garlic, drizzle with EVOO, sprinkle with flaky sea salt and cut bread into chunks.@Add the chicken back to sauce and heat the meat through, 3 to 4 minutes, turning occasionally. Add the sliced lemons and coat with sauce. Add parsley and transfer to plates. Serve cutlets with a small handful of arugula leaves alongside and some charred bread for mopping.","rank":"","__v":0},{"_id":"64497cf05b688aadf1043dca","recipe":"Tortilla Pizzas with Chorizo","serving":"4","time":"30","calorie":"630","protein":"24","carb":"42","fat":"40","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2016/7/22/1/FNM090116_Mexican-Tortilla-Pizzas-with-Chorizo_s4x3.jpg.rend.hgtvcom.1280.720.suffix/1469169361082.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/tortilla-pizzas-with-chorizo-3562018","ingredient":"2 tablespoons extra-virgin olive oil@8 ounces fresh chorizo, casings removed, crumbled@4 8-inch flour tortillas@1 16-ounce can refried beans@1 cup shredded Oaxaca or mozzarella cheese (about 4 ounces)@3 ounces mâche lettuce or arugula@1/2 cup fresh cilantro@3 radishes, thinly sliced@1 red jalapeno pepper, sliced (remove seeds for less heat) @Juice of 1 lime @Kosher salt@1 avocado, diced@1/3 cup Mexican crema or sour cream","step":"Preheat the oven to 400 degrees F. Heat 1 tablespoon olive oil in a large nonstick skillet over medium heat. Add the chorizo and cook, stirring occasionally, until browned, about 4 minutes. Remove the chorizo to a plate with a slotted spoon. Transfer all but 1 tablespoon of the drippings to a small bowl; stir the remaining 1 tablespoon olive oil into the bowl (reserve the skillet). Divide the tortillas between 2 baking sheets and brush the tops with the drippings mixture. Bake until the tortillas are crisp and lightly golden, about 5 minutes.@Heat the skillet with the reserved 1 tablespoon drippings over medium-high heat. Add the refried beans and cook, stirring, until warm and spreadable, about 2 minutes. Spread the beans over the tortillas and sprinkle with the chorizo and cheese. Bake until the cheese melts, about 5 minutes.@Meanwhile, combine the lettuce, cilantro, radishes, jalapeño and lime juice in a large bowl; season with salt and toss. Top each tortilla with the salad, avocado and crema.","rank":"","__v":0},{"_id":"64497d085b688aadf1043dce","recipe":"Spicy Tofu and Vegetable Lo Mein","serving":"4","time":"30","calorie":"440","protein":"23","carb":"52","fat":"19","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2017/11/16/1/FNM_120117-Spicy-Tofu-and-Vegetable-LoMein_s4x3.jpg.rend.hgtvcom.826.620.suffix/1510883076456.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/spicy-tofu-and-vegetable-lo-mein-4555213","ingredient":"Kosher salt@1 14-ounce package extra-firm tofu, drained and cut into 1-inch pieces@Freshly ground pepper@3 tablespoons vegetable oil@8 ounces thin whole wheat spaghetti@3 tablespoons low-sodium soy sauce@2 tablespoons oyster sauce or vegetarian oyster sauce@1 12-ounce bag broccoli florets@1 red bell pepper, cut into thin strips@1 carrot, halved crosswise and cut into thin strips@1 red jalapeno pepper, sliced (remove seeds for less heat)@2 tablespoons finely chopped peeled fresh ginger@1 teaspoon toasted sesame oil","step":"Bring a medium saucepan of salted water to a boil. Pat the tofu dry between 2 layers of paper towels; season with salt and pepper. Heat 2 tablespoons vegetable oil in a large nonstick skillet over medium heat. Add the tofu and cook, turning once, until well browned and slightly crisp, about 15 minutes; transfer to a plate.@Meanwhile, cook the pasta in the boiling water, 1 to 2 minutes less than the label directs for al dente. Reserve 1 cup cooking water, then drain. Mix the soy sauce, oyster sauce and 1/2 cup of the cooking water in a small bowl.@Add the remaining 1 tablespoon vegetable oil to the skillet. Increase the heat to high and add the broccoli. Cook, stirring, until crisp-tender, about 5 minutes. Add the bell pepper, carrot, jalapeno and ginger and cook until just softened, 2 more minutes. Add the noodles, tofu and soy sauce mixture and cook, tossing, until most of the sauce is absorbed, about 2 minutes. Stir in enough of the remaining 1/2 cup cooking water to loosen. Drizzle with the sesame oil, season with salt and toss.","rank":"","__v":0},{"_id":"64497d1c5b688aadf1043dd2","recipe":"Chicken Summer Rolls","serving":"3","time":"30","calorie":"342","protein":"22","carb":"36","fat":"13","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/6/6/0/FN_Chicken-Summer-Rolls_s4x3.jpg.rend.hgtvcom.826.620.suffix/1371597708666.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/chicken-summer-rolls-recipe-2117644","ingredient":"1/4 cup rice vinegar, plus 1 to 2 tablespoons@4 teaspoons sugar, divided@2 cups shredded, cooked chicken (from a rotisserie or other leftover chicken)@1 medium-large carrot, shredded (about 1 cup)@Kosher salt@12 (8 1/2-inch) rice paper wrappers@About 12 Boston lettuce leaves@1/3 English cucumber or 1 kirby cucumber, peeled, julienned, about 1 cup@4 scallions (white and green parts) finely chopped (about 1/2 cup)@1/2 cup fresh mint leaves, basil or cilantro@1/2 cup cooked brown or white rice@1/2 cup chunky peanut butter@2 tablespoons soy sauce","step":"Whisk 1/4 cup rice vinegar with 2 teaspoons sugar in a medium bowl until the sugar dissolves. Add the chicken and carrot, season with salt to taste and set aside.@Fill a large bowl with warm water. Working with 2 sheets of rice paper at a time (keep the others covered with a barely damp cloth to prevent curling), immerse the papers in the warm water until slightly softened (about 15 seconds). Remove and spread out on a clean surface or cutting board. Pat dry with a towel to remove excess water. @Lay 2 pieces of lettuce over the bottom third of the rice paper, leaving about 1/2 inch clear on the edges. Place about 1/3 cup of the chicken-and-carrot mixture on the lettuce, top with 4 to 5 pieces of cucumber and scallion, several mint leaves and about 1 heaping tablespoon of rice. @Roll up the paper halfway into a cylinder. Fold both edges in to tuck while continuing to roll the paper to seal. Place the rolls on a plate covered with a damp towel so they stay moist as you prepare the remaining rolls. Cut the rolls in half. @Whisk the peanut butter, soy sauce, 3 tablespoons of water and the remaining 1 to 2 tablespoons of rice vinegar and 2 teaspoons sugar in a medium bowl until smooth. Serve the rolls with the dipping sauce immediately.","rank":"","__v":0},{"_id":"64497d355b688aadf1043dd6","recipe":"Spicy Pork and Sweet Potato Stew","serving":"4","time":"30","calorie":"570","protein":"48","carb":"48","fat":"21","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2014/6/17/1/FN_30-Minute-Spicy-Pork-Sweet-Potato-Stew_s4x3.jpg.rend.hgtvcom.826.620.suffix/1406257018420.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-spicy-pork-and-sweet-potato-stew-3362961","ingredient":"1 cup canned unsalted diced tomatoes@1 medium white onion, quartered@2 cloves garlic@1/2 chipotle in adobo sauce, plus 1 tablespoon of the sauce@2 tablespoons vegetable oil@1 large pork tenderloin, trimmed and cut into 1-inch chunks (about 1 1/2 pounds)@Kosher salt and freshly ground black pepper@1 tablespoon chili powder@One 8-ounce sweet potato, peeled and cut into 1/2-inch chunks@2 cups low-sodium chicken broth@1 tablespoon pickled jalapenos@1 cup 2 percent Greek yogurt@1/4 medium head red cabbage@1 medium Haas avocado@1 lime@1/2 cup loosely packed fresh cilantro@Eight 6-inch corn tortillas, warmed","step":"Puree the tomatoes, onions, garlic, chipotle and adobo sauce in a food processor until completely smooth.@Heat the oil in a large Dutch oven or pot over medium-high heat until nearly smoking. Add the pork in a single layer, season with 1 teaspoon salt and 1/2 teaspoon pepper and cook, undisturbed, until beginning to brown, about 2 minutes. Turn the pieces and cook until brown, about 1 minute more. Dust the meat with the chili powder, and add the tomato puree, sweet potatoes, chicken broth, 1/4 teaspoon salt and a few grinds of pepper. Bring to a boil, reduce the heat to medium, cover and gently simmer until the meat is cooked through and the potatoes are tender, about 15 minutes.@Meanwhile, prepare the toppings: Chop the jalapenos, and whisk together with the yogurt in a small bowl. Shred the cabbage, cut the avocado into chunks and cut the lime into wedges.@Ladle the stew into large, deep bowls. Top with the yogurt mixture, garnish with the cabbage, avocado, lime and cilantro and serve with the tortillas.","rank":"","__v":0},{"_id":"64497d4a5b688aadf1043dda","recipe":"Mushroom Quesadillas with Succotash","serving":"4","time":"30","calorie":"670","protein":"27","carb":"80","fat":"30","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2017/4/4/1/FNM050117_Mushroom-Quesadillas-with-Succotash_s4x3.jpg.rend.hgtvcom.826.620.suffix/1491339408050.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/mushroom-quesadillas-with-succotash-3677238","ingredient":"3 tablespoons unsalted butter@12 ounces sliced white mushrooms (5 to 6 cups)@Kosher salt and freshly ground pepper@1 small red onion, thinly sliced@1 clove garlic, minced@1 1/2 cups grated havarti cheese (about 6 ounces)@1 teaspoon dried oregano (preferably Mexican)@4 10-inch flour tortillas@1 red jalapeno pepper, seeded and thinly sliced@2 cups frozen corn@2 cups frozen lima beans@2 scallions, chopped","step":"Melt 1 tablespoon butter in a large nonstick skillet over medium-high heat. Add the mushrooms, 1/2 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until browned and tender, 5 to 7 minutes. Add 1 tablespoon butter, the red onion and garlic and cook, stirring occasionally, until softened, about 3 minutes. Remove the vegetables to a plate; let cool. Wipe out the skillet.@Toss the cheese with the oregano in a large bowl. Sprinkle on one side of each tortilla and top with the mushroom mixture. Fold the tortillas in half to cover the filling.@Return the skillet to medium heat. Working in batches, cook the quesadillas, flipping once, until the cheese melts and the tortillas are browned and crisp, 5 to 7 minutes.@Meanwhile, melt the remaining 1 tablespoon butter in a medium saucepan over medium heat. Add the jalapeno and cook, stirring, until softened, about 2 minutes. Add the corn, lima beans, 1/2 cup water and a pinch of salt. Increase the heat to medium high and bring to a boil. Reduce to a simmer and cook, stirring occasionally, until most of the liquid is evaporated, about 5 minutes. Season with salt and stir in the scallions. Cut the quesadillas into wedges and serve with the succotash.","rank":"","__v":0},{"_id":"64497d665b688aadf1043dde","recipe":"Beef Picadillo Enchiladas","serving":"4","time":"45","calorie":"932","protein":"40","carb":"53","fat":"64","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2018/4/2/3/LS-Library_Beef-Picadillo-Enchiladas_s4x3.jpg.rend.hgtvcom.826.620.suffix/1522724788027.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/beef-picadillo-enchiladas-5496978","ingredient":"1/3 cup vegetable oil@1 medium onion, diced@1 green bell pepper, diced@1 pound 80-percent lean ground beef@1 teaspoon Chinese five-spice powder@Kosher salt and freshly ground black pepper@One 14-ounce can crushed tomatoes@1/4 cup green olives, sliced@1/4 cup golden raisins@Twelve 6-inch corn tortillas2 cups shredded Cheddar (about 8 ounces)","step":"Preheat the oven to 350 degrees F. Heat a large skillet over medium-high heat. Add 1 tablespoon of oil, the onion and pepper and cook, stirring, until soft, about 5 minutes. Add the ground beef, five-spice, 1 teaspoon salt and a few grinds of pepper. Cook, breaking up the meat, until it begins to brown, about 5 minutes. Stir in the tomatoes, olives and raisins. Bring to a simmer and cook until thickened, about 2 minutes. Season with salt and pepper.@Heat the remaining oil in a small skillet over medium heat. Once the oil is shimmering, heat the tortillas, one at a time, in the hot oil until they bubble and darken slightly, about 10 seconds per side. Drain on paper towels. Spread about 1/2 cup ground beef picadillo mixture on the bottom of a 9 -by-13-inch baking dish. Put about 1/4 cup picadillo and 1 tablespoon Cheddar down the center of each tortilla. Roll tightly and lay them in the baking dish, seam side down. Spoon the rest of the picadillo over the enchiladas and sprinkle with the remaining cheese. Bake the enchiladas until the tortillas are slightly crisp and the cheese is melted, about 10 minutes. ","rank":"4","__v":0},{"_id":"64497d825b688aadf1043de2","recipe":"Beef Stroganoff Burgers","serving":"4","time":"35","calorie":"610","protein":"29","carb":"34","fat":"40","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2018/4/5/0/LS-Library_Beef-Stroganoff-Burgers_s4x3.jpg.rend.hgtvcom.826.620.suffix/1522779224719.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/beef-stroganoff-burgers-5485985","ingredient":"5 portobello mushrooms (4 to 5 ounces each)@2 tablespoons plus 2 teaspoons olive oil@Kosher salt and freshly ground black pepper@1 small onion, diced@1 medium garlic clove, minced@1 teaspoon all-purpose flour@1/2 cup low-sodium beef broth@1/4 cup reduced-fat sour cream@3 tablespoons chopped fresh flat-leaf parsley@1 tablespoon Dijon mustard@2 teaspoons Worcestershire sauce@1 pound ground beef (95 percent lean)@Nonstick cooking spray@4 hamburger buns@Lettuce leaves for topping","step":"Preheat the oven to 425 degrees F. Remove the stems from 4 of the mushrooms and set the stems aside. Put the 4 stemmed mushroom caps, gill-side-up, in a large baking dish, making sure there is at least 1/2 inch of space between them. Drizzle with 2 tablespoons of the oil. Season with salt and pepper. Roast until a knife inserted in the center meets just a bit of resistance, 20 to 25 minutes. Remove and keep warm.@Clean and roughly chop the reserved mushroom stems and the remaining portobello. Heat the remaining 2 teaspoons oil in a medium nonstick skillet over medium heat. Add the onion and a pinch of salt and cook, stirring, until soft and translucent, about 4 minutes. Add the chopped mushrooms, garlic and a generous amount of black pepper; cook until the stems are soft, about 4 minutes.@Sprinkle the flour over the onions and mushrooms and stir until all of the flour has been absorbed. Stir in the beef broth. Bring to a simmer and cook, stirring, until thick, about 5 minutes. Remove from the heat and stir in the sour cream, parsley, mustard and Worcestershire sauce. . Keep warm while you grill the burgers.@Shape the ground beef into four patties, each about 5-inches in diameter. Sprinkle well with salt and pepper. Heat a nonstick grill pan over medium heat. When the pan is hot, spray it liberally with nonstick cooking spray. Add the burgers and cook until nicely browned, about 2 minutes. Flip the burgers and cook for another 1 1/2 minutes for medium-rare.@Put the bottoms of the buns on serving plates. Top each with a lettuce leaf and a roasted mushroom, gill-side down, then top with a burger and a generous dollop of the sour cream-mushroom sauce. Cover with bun tops and serve. ","rank":"","__v":0},{"_id":"64497d9d5b688aadf1043de6","recipe":"Moroccan Meatball Soup","serving":"4","time":"40","calorie":"400","protein":"34","carb":"30","fat":"18","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2017/5/10/0/FNM_060117-Moroccan-Meatball-Soup-Recipe_s4x3.jpg.rend.hgtvcom.826.620.suffix/1494459082561.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/moroccan-meatball-soup-3721438","ingredient":"1 1/2 cups fresh cilantro@1 bunch scallions, roughly chopped@1 pound lean ground beef@1 large egg, lightly beaten@2 tablespoons harissa@1 1/2 teaspoons ground cumin, plus more for topping@Kosher salt@1 tablespoon extra-virgin olive oil@4 carrots, cut into 1-inch pieces@4 cups low-sodium chicken broth@4 cups baby spinach@1/2 cup whole-wheat couscous","step":"Pulse 1 cup cilantro with the scallions in a mini food processor to make a coarse puree. Transfer half of the mixture to a large bowl and add the ground beef, egg, 1 tablespoon harissa, 1/2 teaspoon cumin and 1/2 teaspoon salt. Mix with your hands until just combined. Form into twenty 1-inch meatballs.@Heat the olive oil in a large pot over medium heat. Add the carrots and cook, stirring, until they start browning, 4 to 5 minutes. Stir in the remaining cilantro puree, 1 tablespoon harissa and 1 teaspoon cumin; cook until sizzling, about 1 minute. Stir in the chicken broth and 2 cups water; bring to a simmer and cook 2 minutes. Gently drop in the meatballs and simmer until almost cooked through, 7 to 8 minutes.@Add the spinach and couscous to the soup and cook until the couscous is tender, about 5 minutes. Stir in the remaining 1/2 cup cilantro and season with salt. Sprinkle with more cumin before serving.","rank":"","__v":0},{"_id":"64497db15b688aadf1043dea","recipe":"Quick Spicy Chili","serving":"4","time":"40","calorie":"556","protein":"29","carb":"34","fat":"32","image":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2018/4/1/2/LS-Library_Quick-Spicy-Chil_s4x3.jpg.rend.hgtvcom.826.620.suffix/1522678073200.jpeg","website":"https://www.foodnetwork.com/recipes/food-network-kitchen/quick-spicy-chili-5458466","ingredient":"2 tablespoons extra-virgin olive oil@1 onion, chopped@5 cloves garlic, chopped@2 teaspoons chili powder@1 teaspoon dried oregano@Kosher salt and freshly ground black pepper@1 tablespoon tomato paste@1 to 2 chipotle chiles in adobo, coarsely chopped, plus 1 tablespoon sauce@1 pound ground beef@One 12-ounce bottle beer, such as lager@One 14.5-ounce can diced tomatoes@One 15.5-ounce can black beans, rinsed and drained@Diced avocado, shredded cheese, cilantro leaves, sliced scallions and sour cream, for serving, optional","step":"Heat the olive oil in a large heavy skillet over medium-high heat. Add the onions, garlic, chili powder, oregano, 1 teaspoon salt and a few grinds of pepper. Cook, stirring occasionally, until the onion is soft, 3 to 5 minutes. Stir in the tomato paste, the chipotle chiles and sauce, and cook for 1 minute. Add the beef and cook, breaking it up with a wooden spoon, until no longer pink, about 3 minutes.@Add the beer and simmer until reduced by about half, about 8 minutes. Add the tomatoes and beans and bring to a boil. Cook, uncovered, stirring occasionally, until thick, about 10 minutes. Adjust the seasoning with salt and pepper and serve with desired assorted toppings.","rank":"","__v":0},{"_id":"644980e45b688aadf1043dee","recipe":"Skillet Pork Chops and Beans","serving":"4","time":"30","calorie":"497","protein":"44","carb":"39","fat":"18","image":"https://www.realsimple.com/thmb/y-Xr89q85KhpPARUDK0VEYQtDRA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/skillet-pork-chops-and-beans-recipe1221DIN_021-a84b259b7c0144eb89fec5df05d54edb.jpg","website":"https://www.realsimple.com/food-recipes/browse-all-recipes/skillet-pork-chops-and-beans-recipe","ingredient":"1 cup seasoned croutons (from a 5-oz. pkg.)@2 tablespoons extra-virgin olive oil@4 boneless, center-cut pork chops (each 6 to 7 oz.and 1 in. thick)@1 ¼ teaspoons kosher salt, divided@1 cup finely chopped yellow onion (from 1 onion)@2 medium carrots, halved lengthwise and thinly sliced crosswise (about 1 cup)@1 tablespoon thinly sliced fresh sage@1 tablespoon minced garlic (from 3 cloves)@2 15.5-oz. cans cannellini beans, drained and rinsed@1 cup lower-sodium chicken stock","step":"Preheat oven to 375°F. Place croutons in a zip-top bag and crush with a rolling pin until coarse crumbs form.@Heat oil in a 12-inch oven-safe skillet over medium-high. Pat pork chops dry and season with ½ teaspoon salt. Add pork to skillet; cook, undisturbed, flipping once, until lightly browned on both sides, about 3 minutes per side. Transfer to a plate.@Add onion and carrots to skillet. Cook over medium, stirring often, until onion softens and starts to brown, about 6 minutes. Add sage and garlic; cook, stirring, until fragrant, about 30 seconds. Stir in beans, stock, and remaining 3/4 teaspoon salt@Nestle pork chops in bean mixture. Bake until a thermometer inserted in thickest portion of pork chops registers 145°F, 8 to 12 minutes. Sprinkle crouton crumbs around pork chops.","rank":"","__v":0},{"_id":"644980fb5b688aadf1043df2","recipe":"Turkey-Pumpkin Chili","serving":"4","time":"35","calorie":"482","protein":"38","carb":"47","fat":"17","image":"https://www.realsimple.com/thmb/R-WphOrLphMCIF5AmCyBlvodO7A=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/turkey-pumpkin-chili-recipe-1020din-7183c2eccc2f49558f1294b08971ec2c.jpg","website":"https://www.realsimple.com/food-recipes/browse-all-recipes/turkey-pumpkin-chili-recipe","ingredient":"2 tablespoons olive oil@1 small yellow onion, chopped@1 pound 93% lean ground turkey@1 tablespoon plus 1 tsp. ground coriander@2 ½ teaspoons smoked paprika@1 ½ teaspoons kosher salt@2 15-oz. cans cannellini beans, drained and rinsed@1 15-oz. can pumpkin puree@1 ½ cups low-sodium chicken broth@Hot sauce, sour cream, and sliced scallions, for serving","step":"Heat oil in a medium heavy-bottomed pot over medium-high. Add onion and cook, stirring occasionally, until tender, about 5 minutes. Stir in turkey, coriander, paprika, and salt; cook, stirring occasionally, until turkey is browned, about 5 minutes.@Stir beans, pumpkin, 1¾ cups water, and broth into turkey mixture. Bring to a simmer over medium-high, stirring occasionally. Reduce heat to medium and cook, stirring often, until heated through, about 15 minutes. Top with hot sauce, sour cream, and scallions.","rank":"","__v":0},{"_id":"644981115b688aadf1043df6","recipe":"Roasted Spiced Salmon","serving":"4","time":"40","calorie":"744","protein":"44","carb":"58","fat":"37","image":"https://www.realsimple.com/thmb/kRJZccwTLj91ly9AjxXLQyN6OZA=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/roasted-salmon-recipe-0420din-fb9b63485b064e659ef4f30e58b1ad2b.jpg","website":"https://www.realsimple.com/food-recipes/browse-all-recipes/roasted-salmon-recipe","ingredient":"¼ cup olive oil, divided@1 cup basmati rice@½ cup golden raisins@1 cinnamon stick@2 ¼ teaspoons kosher salt, divided@4 tablespoons unsalted butter, softened@½ teaspoon ground turmeric@½ teaspoon coarsely chopped cumin seeds@4 6-ounce skin-on salmon fillets@4 cups packed fresh baby spinach@1 teaspoon fresh lemon juice (from 1 lemon)@⅛ teaspoon freshly ground black pepper","step":"Preheat oven to 325 F. Heat 2 tablespoons oil in a medium saucepan over medium. Add rice, raisins, and cinnamon stick. Cook, stirring often, until rice is fragrant and slightly opaque, about 2 minutes. Stir in 2 cups water and 1½ teaspoons salt; bring to a boil over high. Reduce heat to low, cover, and simmer, undisturbed, until liquid is absorbed, about 10 minutes. Remove from heat and let stand, covered, until rice is just tender, about 10 minutes. Fluff with a fork.@Meanwhile, mash butter, turmeric, cumin, and ½ teaspoon salt in a small bowl. Place salmon, skin side down, in a 13-by-9-inch baking dish. Spread butter mixture over salmon; cover with aluminum foil. Bake until salmon is firm when squeezed along sides, 20 to 25 minutes.@Toss spinach, lemon juice, pepper, and remaining 2 tablespoons oil and ¼ teaspoon salt in a medium bowl. Serve salad alongside salmon and rice.","rank":"","__v":0},{"_id":"644981275b688aadf1043dfa","recipe":"Roasted Curry Salmon With Tomatoes","serving":"4","time":"20","calorie":"509","protein":"43","carb":"44","fat":"16","image":"https://www.realsimple.com/thmb/6B_zIx6hbBGOCnH9y7wGDM9W1_U=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/basil-salmon_300-9ff82bed86cc48668826a38723714042.jpg","website":"https://www.realsimple.com/food-recipes/browse-all-recipes/roasted-curry-salmon-tomatoes","ingredient":"1 cup long-grain white rice@1 pint grape tomatoes@1 tablespoon olive oil@kosher salt and black pepper@1 ½ pound skinless salmon fillet@2 teaspoons curry powder@¼ cup torn fresh basil","step":"Heat oven to 400º F. Cook the rice according to the package directions.@Meanwhile, toss the tomatoes, oil, and ¼ teaspoon each salt and pepper on a rimmed baking sheet.@Nestle the salmon among the tomatoes. Season with the curry powder, ½ teaspoon salt, and ¼ teaspoon pepper. Roast until the salmon is opaque throughout and the tomatoes are soft, 15 to 18 minutes.@Serve over the rice and sprinkle with the basil.","rank":"","__v":0},{"_id":"6449813a5b688aadf1043dfe","recipe":"Jalapeno Popper Chicken","serving":"4","time":"40","calorie":"526","protein":"38","carb":"8","fat":"40","image":"https://www.castironketo.net/wp-content/uploads/2018/02/Jalapeno-Popper-Chicken-1-500x500.jpg","website":"https://www.castironketo.net/blog/keto-jalapeno-popper-chicken/","ingredient":"4 (4-ounce) chicken breasts@2 jalapeños@4 ounces cream cheese@4 ounces cheddar cheese@8 strips bacon","step":"Flatten chicken out to ½ inch thickness. Preheat oven to 375° F.@Divide jalapeño and cheese equally between each chicken breast and roll the chicken tightly around filling.@Wrap each chicken breast with 2 slices of bacon and place in skillet or oven safe baking dish.@Bake for 30 minutes or until bacon is crispy on the outside and chicken is cooked through.","rank":"","__v":0},{"_id":"6449814e5b688aadf1043e02","recipe":"Slow-Cooker Breakfast Burritos","serving":"12","time":"245","calorie":"359","protein":"16","carb":"39","fat":"15","image":"https://www.tasteofhome.com/wp-content/uploads/2019/07/Slow-Cooker-Breakfast-Burritos_EXPS_TOHAS19_237919_E04_18_3b-1.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/slow-cooker-breakfast-burritos/","ingredient":"1 pound bulk pork sausage@1 package (28 ounces) frozen O'Brien potatoes, thawed@2 cups shredded sharp cheddar cheese@12 large eggs@1/2 cup 2% milk@1/4 teaspoon seasoned salt@1/8 teaspoon pepper@12 flour tortillas (8 inches)@Optional toppings: Salsa, sliced jalapenos, chopped tomatoes, sliced green onions and cubed avocado","step":"In a large skillet, cook sausage over medium heat until no longer pink, 8-10 minutes, breaking into crumbles; drain.@In a greased 4- or 5-qt. slow cooker, layer potatoes, sausage and cheese. In a large bowl, whisk eggs, milk, seasoned salt and pepper until blended; pour over top.@Cook, covered, on low 3-3/4 to 4-1/4 hours or until eggs are set and a thermometer reads 160°. Uncover and let stand 10 minutes. Serve in tortillas with toppings of your choice.","rank":"","__v":0},{"_id":"644981625b688aadf1043e06","recipe":"Apple Butter Biscuit Breakfast Bake","serving":"12","time":"80","calorie":"331","protein":"16","carb":"31","fat":"15","image":"https://tmbidigitalassetsazure.blob.core.windows.net/wpthumbnailsprod/AppleButterBiscuitBreakfastBake%20DIYD%20226456%20020121%20H_thumbnail.jpeg","website":"https://www.tasteofhome.com/recipes/apple-butter-biscuit-breakfast-bake/","ingredient":"10 leftover biscuits (3-inch diameter)@3/4 cup apple butter@2 cups shredded sharp cheddar cheese@1-1/2 cups cubed fully cooked ham@1/4 cup minced fresh parsley@6 large eggs@2-1/2 cups 2% milk@1 teaspoon salt@1/2 teaspoon pepper@1/4 teaspoon ground mustard","step":"Cut biscuits crosswise in half. Spread apple butter over cut sides of biscuits. Replace tops. Cut each biscuit into quarters; arrange in a single layer in a greased 13x9-in. baking dish. Top with cheese, ham and parsley.@In a large bowl, whisk eggs, milk, salt, pepper and mustard. Pour over biscuits. Cover and refrigerate overnight.@Preheat oven to 325°. Remove strata from refrigerator while oven heats. Bake, uncovered, until puffed and edges are golden brown, 50-60 minutes. Let stand 10 minutes before cutting.","rank":"","__v":0},{"_id":"644981775b688aadf1043e0a","recipe":"Pumpkin French Toast with Bacon Maple Syrup","serving":"8","time":"75","calorie":"486","protein":"10","carb":"62","fat":"23","image":"https://www.tasteofhome.com/wp-content/uploads/2020/08/Pumpkin-French-Toast-with-Bacon-Maple-Syrup_EXPS_TOHDJ21_249332_E07_30_2b-21.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/pumpkin-french-toast-with-bacon-maple-syrup/","ingredient":"@@4 bacon strips@1-1/4 cups 2% milk@3 large eggs@1/2 cup plus 3 tablespoons packed light brown sugar, divided@1/2 cup canned pumpkin@2 tablespoons maple syrup@2-1/2 teaspoons pumpkin pie spice, divided@12 ounces challah or brioche bread, cut into 1/2-inch cubes@1/4 cup quick-cooking oats@1/4 cup chopped pecans, toasted@3 tablespoons all-purpose flour@3 tablespoons cold butter@@Sauce@@3 tablespoons butter@3 tablespoons light brown sugar@3 tablespoons maple syrup@3 tablespoons 2% milk@3 tablespoons canned pumpkin","step":"In a large skillet, cook bacon over medium heat until crisp. Remove to paper towels to drain; crumble bacon. Discard drippings, reserving 1 tablespoon for sauce. In a large bowl, whisk milk, eggs, 1/2 cup brown sugar, pumpkin, maple syrup and 2 teaspoons pie spice until blended.@Place half the bread cubes in a greased 2-qt. baking dish. Top with half the crumbled bacon and half the egg mixture. Repeat layers. Refrigerate, covered, overnight.@Preheat oven to 350°. Remove casserole from refrigerator while oven heats. Combine oats, pecans, flour, and the remaining 3 tablespoons brown sugar and 1/2 teaspoon pie spice. Cut in cold butter until mixture resembles coarse crumbs. Sprinkle over casserole.@Bake, uncovered, until a knife inserted near the center comes out clean, 40-45 minutes. Let stand 5-10 minutes before serving. Meanwhile, for sauce, in a small saucepan, melt butter and reserved bacon grease over medium heat. Stir in brown sugar and maple syrup. Add milk and pumpkin; heat through. Serve with French toast.","rank":"","__v":0},{"_id":"6449818b5b688aadf1043e0e","recipe":"Cheddar and Chorizo Strata","serving":"8","time":"60","calorie":"370","protein":"22","carb":"21","fat":"22","image":"https://www.tasteofhome.com/wp-content/uploads/2019/02/Cheddar-and-Chorizo-Strata_EXPS_SDAM19_199596_B12_06_2b-16.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/cheddar-and-chorizo-strata/","ingredient":"7 cups day-old French bread cut into 1-inch cubes@2 cups shredded cheddar cheese, divided@1 package (10 ounces) frozen chopped spinach, thawed and squeezed dry@6 ounces fresh chorizo, crumbled@1/3 cup chopped onion@6 large eggs@2-1/4 cups 2% milk@1 teaspoon garlic salt@1 teaspoon prepared mustard","step":"Place 4 cups bread cubes in a single layer in a greased 13x9-in. baking dish. Sprinkle with 1 cup cheese and the spinach. Layer with chorizo and onion; top with remaining bread and cheese.@In a large bowl, whisk eggs, milk, garlic salt and mustard. Pour over bread. Refrigerate, covered, several hours or overnight.@Preheat oven to 350°. Remove strata from refrigerator while oven heats. Bake, uncovered, until golden brown and a knife inserted near the center comes out clean, 40-45 minutes. Let stand 5-10 minutes before serving.","rank":"","__v":0},{"_id":"644981a15b688aadf1043e12","recipe":"Strawberry Overnight Oats","serving":"1","time":"75","calorie":"352","protein":"10","carb":"60","fat":"10","image":"https://www.tasteofhome.com/wp-content/uploads/2020/12/Peanut-Butter-and-Jelly-Overnight-Oats-_EXPS_RC20_253830_E09_09_2b-25.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/strawberry-overnight-oats/","ingredient":"1 cup sliced fresh strawberries@1/2 teaspoon sugar@3/4 cup old-fashioned oats@3 tablespoons powdered peanut butter@1-1/2 teaspoons chia seeds@1 cup unsweetened almond milk","step":"In a small bowl, combine strawberries and sugar. Let stand 1 hour; mash if desired. In a pint jar, layer 1/4 cup oats, 1 tablespoon powdered peanut butter, 1/2 teaspoon chia seeds and 1/3 cup strawberry mixture. Repeat layers twice. Pour almond milk over top; seal and refrigerate overnight.","rank":"","__v":0},{"_id":"644981b45b688aadf1043e16","recipe":"Baked French Toast","serving":"8","time":"60","calorie":"297","protein":"9","carb":"32","fat":"15","image":"https://www.tasteofhome.com/wp-content/uploads/2018/01/Baked-French-Toast_EXPS_THAM18_206137_B10_09_5b-25.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/baked-french-toast/","ingredient":"@@8 ounces day-old French bread, unsliced@4 large eggs@2 tablespoons sugar@1 tablespoon brown sugar@2 teaspoons vanilla extract@1 teaspoon maple extract@1/4 teaspoon kosher salt@2 cups 2% milk@1/2 cup heavy whipping cream@@Topping@@1/4 cup all-purpose flour@3 tablespoons brown sugar@3 tablespoons unsalted butter, cut into 1/4-inch cubes@1 teaspoon ground cinnamon@Freshly grated nutmeg, optional@Fresh blueberries or raspberries@Confectioners' sugar","step":"Cut bread into 1-in.-thick slices. Arrange in a single layer in a greased 13x9-in. baking dish. Lightly beat next 6 ingredients; stir in milk and cream. Pour egg mixture over bread, turning once to coat. Refrigerate, covered, overnight.@Preheat oven to 375°. Turn bread again to coat. For topping, combine flour, brown sugar, butter, cinnamon and, if desired, nutmeg. Sprinkle flour mixture over bread.@Bake, uncovered, until a knife inserted in center comes out clean and topping is golden brown, 40-45 minutes. Let stand 10 minutes before cutting. Top with blueberries or raspberries; sprinkle with confectioners' sugar.","rank":"","__v":0},{"_id":"644981c85b688aadf1043e1a","recipe":"Hawaiian Bacon & Pineapple Breakfast Bake","serving":"12","time":"55","calorie":"308","protein":"21","carb":"23","fat":"15","image":"https://www.tasteofhome.com/wp-content/uploads/2018/01/exps103183_BB143289B07_15_3b-7.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/hawaiian-bacon-pineapple-breakfast-bake/","ingredient":"8 large eggs@2 cups 2% milk@2 teaspoons Worcestershire sauce@1 teaspoon ground mustard@1 cup shredded part-skim mozzarella cheese@1 cup shredded cheddar cheese@1 cup crumbled cooked bacon (about 14 slices)@1 cup cubed fully cooked ham@3/4 cup pineapple tidbits@1 package (12 ounces) Hawaiian sweet rolls, cut into 1-inch cubes@1/2 cup coarsely crushed french-fried onions","step":"In a large bowl, whisk eggs, milk, Worcestershire sauce and mustard until blended. Stir in cheeses, bacon, ham and pineapple. Gently stir in cubed rolls. Transfer to a greased 13x9-in. baking dish. Refrigerate, covered, several hours or overnight.@Preheat oven to 350°. Remove casserole from refrigerator while oven heats. Bake, uncovered, 35-45 minutes or until golden brown and a knife inserted in the center comes out clean, sprinkling with onions halfway through baking. Let stand 5-10 minutes before cutting.","rank":"","__v":0},{"_id":"644981dd5b688aadf1043e1e","recipe":"Fluffy Waffles","serving":"10","time":"45","calorie":"424","protein":"9","carb":"71","fat":"12","image":"https://tmbidigitalassetsazure.blob.core.windows.net/rms3-prod/attachments/37/1200x1200/Fluffy-Waffles_EXPS_TOHcom21_21376_B10_28_1b.jpg","website":"https://www.tasteofhome.com/recipes/fluffy-waffles/","ingredient":"@@2 cups all-purpose flour@1 tablespoon sugar@2 teaspoons baking powder@1/2 teaspoon salt@3 large eggs, separated@2 cups 2% milk@1/4 cup canola oil@@Cinnamon Cream Syrup@@1 cup sugar@1/2 cup light corn syrup@1/4 cup water@1 can (5 ounces) evaporated milk@1 teaspoon vanilla extract@1/2 teaspoon ground cinnamon@Mixed fresh berries, optional","step":"In a bowl, combine the flour, sugar, baking powder and salt. Combine the egg yolks, milk and oil; stir into dry ingredients just until moistened. In a small bowl, beat egg whites until stiff peaks form; fold into batter. Bake in a preheated waffle maker according to manufacturer's directions.@Meanwhile, for syrup, combine sugar, corn syrup and water in a saucepan. Bring to a boil over medium heat; cook and stir for 2 minutes or until thickened. Remove from the heat; stir in the milk, vanilla and cinnamon. Serve with waffles. If desired, serve with fresh berries.","rank":"","__v":0},{"_id":"644981f25b688aadf1043e22","recipe":"Overnight Pancakes","serving":"10","time":"20","calorie":"319","protein":"12","carb":"44","fat":"10","image":"https://www.tasteofhome.com/wp-content/uploads/2018/01/Overnight-Pancakes_EXPS_THCA18_9637_C05_12_5b-1.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/overnight-pancakes/","ingredient":"1 package (1/4 ounce) active dry yeast@1/4 cup warm water (110° to 115°)@4 cups all-purpose flour@1 tablespoon baking powder@2 teaspoons baking soda@2 teaspoons sugar@1 teaspoon salt@6 large eggs, room temperature@4 cups buttermilk@1/4 cup canola oil","step":"Dissolve yeast in warm water; let stand for 5 minutes. Meanwhile, in another bowl, combine the next 5 ingredients. Whisk eggs, buttermilk and oil; stir into flour mixture just until moistened. Stir in yeast mixture. Cover and refrigerate 8 hours or overnight.@To make pancakes, lightly grease griddle and preheat over medium heat. Pour batter by 1/4 cupfuls onto griddle; cook until bubbles on top begin to pop and bottoms are golden brown. Turn; cook until second side is golden brown.","rank":"","__v":0},{"_id":"644982055b688aadf1043e26","recipe":"Brunch Burritos","serving":"10","time":"270","calorie":"683","protein":"35","carb":"41","fat":"38","image":"https://www.tasteofhome.com/wp-content/uploads/2018/01/exps49371_EDSC153431A01_21_4b-2.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/brunch-burritos/","ingredient":"1 pound bulk pork sausage, cooked and drained@1/2 pound bacon strips, cooked and crumbled@18 large eggs, lightly beaten@2 cups frozen shredded hash brown potatoes, thawed@1 large onion, chopped@1 can (10-3/4 ounces) condensed cheddar cheese soup, undiluted@1 can (4 ounces) chopped green chiles@1 teaspoon garlic powder@1/2 teaspoon pepper@2 cups shredded cheddar cheese@10 flour tortillas (10 inches), warmed@Optional toppings: Jalapeno peppers, salsa and hot pepper sauce","step":"In a large bowl, combine the first 9 ingredients. Pour half of the egg mixture into a 4- or 5-qt. slow cooker coated with cooking spray. Top with half of the cheese. Repeat layers.@Cook, covered, on low 4-5 hours or until center is set and a thermometer reads 160°.@Spoon 3/4 cup egg mixture across center of each tortilla. Fold bottom and sides of tortilla over filling and roll up. Add toppings of your choice.","rank":"","__v":0},{"_id":"644982255b688aadf1043e2a","recipe":"Sausage & Apple Cornbread Bake","serving":"4","time":"45","calorie":"618","protein":"19","carb":"61","fat":"34","image":"https://www.tasteofhome.com/wp-content/uploads/2018/01/exps74472_BB15369807_02_4b-1.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/sausage-apple-cornbread-bake/","ingredient":"1 pound bulk pork sausage@4 medium tart apples, peeled and sliced (about 4 cups)@1 package (8-1/2 ounces) cornbread/muffin mix@1/3 cup 2% milk@1 large egg@Maple syrup","step":"Preheat oven to 400°. In a large skillet, cook sausage over medium heat until no longer pink, 6-8 minutes, breaking into crumbles; drain. Transfer to a greased 8-in. square baking dish. Top with apples.@In a small bowl, combine muffin mix, milk and egg just until moistened. Pour over apples. Bake, uncovered, until edges are golden brown and a toothpick inserted in center comes out clean, 30-40 minutes. Let stand 10 minutes before serving. Serve with maple syrup.@Make-Ahead: Refrigerate unbaked casserole, covered, several hours or overnight. To use, preheat oven to 400°. Remove casserole from refrigerator while oven heats. Bake as directed, increasing time as necessary until edges are golden brown and a toothpick inserted in center comes out clean. Serve with syrup.","rank":"","__v":0},{"_id":"644982375b688aadf1043e2e","recipe":"Brunch Ham Enchiladas","serving":"10","time":"55","calorie":"397","protein":"21","carb":"31","fat":"20","image":"https://www.tasteofhome.com/wp-content/uploads/2018/01/exps11703_MRR153791D09_22_5b-2.jpg?fit=700,1024","website":"https://www.tasteofhome.com/recipes/brunch-ham-enchiladas/","ingredient":"2 cups cubed fully cooked ham@1/2 cup chopped green onions@10 flour tortillas (8 inches)@2 cups shredded cheddar cheese, divided@1 tablespoon all-purpose flour@2 cups half-and-half cream@6 large eggs, lightly beaten@1/4 teaspoon salt, optional","step":"In a large bowl, combine ham and onions; place about 1/4 cup down the center of each tortilla. Top with 2 tablespoons cheese. Roll up and place seam side down in a greased 13x9-in. baking dish.@In another large bowl, combine the flour, cream, eggs and, if desired, salt until smooth. Pour over tortillas. Cover and refrigerate for 8 hours or overnight.@Remove from the refrigerator 30 minutes before baking. Cover and bake at 350° for 25 minutes. Uncover; bake for 10 minutes. Sprinkle with remaining cheese; bake 3 minutes longer or until the cheese is melted. Let stand for 10 minutes before serving.","rank":"","__v":0}]